{
  "title": "Week 4: Debt & Equity Financing Schedules",
  "content": "# Capital Structure and Financing\n\nHow a company funds its operations—using debt, equity, or a mix—is a strategic decision with profound implications for risk and return. This week covers the mechanics of debt and equity schedules.\n\n## Debt Financing\nCompanies borrow money (e.g., bank loans, bonds) and must pay interest. \n- **Principal**: The original amount of money borrowed.\n- **Interest**: The cost of the debt (often based on LIBOR/SOFR + a spread).\n- **Amortization Schedule**: A table detailing each periodic payment on an amortizing loan.\n\n## Equity Financing\nCompanies raise money by selling ownership (shares).\n- **Common Stock**: Shares entitling their holder to dividends and a vote in shareholder meetings.\n- **Preferred Stock**: Shares with a higher claim on assets and earnings than common stock, usually without voting rights.\n- **Dilution**: The reduction in the ownership percentage of a share of stock caused by the issuance of new shares.\n\n## The Debt vs. Equity Trade-off\n- **Debt** is cheaper (interest is tax-deductible) but increases the risk of bankruptcy.\n- **Equity** is more expensive but safer (no fixed payments required).\n\n## Grammar: Conditional Sentences for Risk (Mixed Conditionals)\nAt C1, use mixed conditionals to discuss hypothetical financial outcomes:\n- *If we had secured the debt financing earlier, our current liquidity position would be much stronger now.*\n- *Were the interest rates to rise, our debt service coverage ratio would fall significantly.*",
  "objectives": [
    "Identify the differences between debt and equity financing",
    "Understand the impact of dilution on shareholders",
    "Use mixed conditionals to discuss financial risk and hypothetical scenarios"
  ],
  "keyTerms": [
    { "term": "Dilution", "definition": "A reduction in the ownership percentage of a share of stock caused by the issuance of new shares." },
    { "term": "Principal", "definition": "The amount borrowed or the amount still owed on a loan, separate from interest." },
    { "term": "DSCR", "definition": "Debt Service Coverage Ratio; a measure of the cash flow available to pay current debt obligations." }
  ]
}
