{
  "title": "Trimester 2 Review & Assessment",
  "sections": [
    {
      "id": "vocab",
      "title": "Consolidated Administrative Vocabulary",
      "content": "This trimester has covered the pillars of advanced business administration. Key areas include:\n\n- **Operations & Quality**: Managing crises (BCP), quality systems (QMS), and process improvement (Kaizen).\n- **Finance & Supply Chain**: Controlling budgets (OPEX/CAPEX), procurement cycles, and vendor relations (SLAs).\n- **Human Resources**: Leading recruitment logistics, onboarding, and performance management (KPIs).\n- **Strategy & Growth**: Conducting macro-analyses (PESTLE), managing change, and planning digital transformation.\n- **Ethics & Law**: Implementing sustainability (CSR), protecting data (GDPR), and ensuring legal compliance (Due Diligence)."
    },
    {
      "id": "grammar",
      "title": "Grammar Masterclass Review",
      "content": "A summary of the advanced structures used in professional administration:\n\n- **Reporting Passives**: \"It is widely believed that...\" for objective reporting.\n- **Inversion for Emphasis**: \"Never have we faced such...\" for formal impact.\n- **Wishes & Regrets**: \"If only we had...\" for evaluating past outcomes.\n- **Mixed Conditionals**: \"If we had acted then, we would be better now.\"\n- **Advanced Modals**: \"The board must have known...\" for speculation.\n- **Nominalization**: Transforming \"We decided\" into \"The decision was made\" for formal objectivity."
    }
  ],
  "objectives": [
    "Synthesise concepts from operations, finance, and strategy to solve administrative cases",
    "Utilise advanced grammar structures to draft a formal executive summary",
    "Identify and mitigate risks in international logistics and business law",
    "Demonstrate proficiency in B2-level administrative English for the workplace"
  ],
  "keyTerms": [
    { "term": "Executive Summary", "definition": "A short document or section of a document, produced for business purposes, that summarises a longer report or proposal." },
    { "term": "Audit Trail", "definition": "A step-by-step record by which data can be traced to its source." }
  ]
}