{
  "title": "Trimester 2 Review & Assessment",
  "sections": [
    {
      "id": "vocab",
      "title": "Consolidated Administrative Vocabulary",
      "content": "This trimester has covered the pillars of advanced business administration. Key areas include:\n\n- **Operations & Quality**: Managing crises (BCP), quality systems (QMS), and process improvement (Kaizen).\n- **Finance & Supply Chain**: Controlling budgets (OPEX/CAPEX), procurement cycles, and vendor relations (SLAs).\n- **Human Resources**: Leading recruitment logistics, onboarding, and performance management (KPIs).\n- **Strategy & Growth**: Conducting macro-analyses (PESTLE), managing change, and planning digital transformation.\n- **Ethics & Law**: Implementing sustainability (CSR), protecting data (GDPR), and ensuring legal compliance (Due Diligence)."
    },
    {
      "id": "grammar",
      "title": "Grammar Masterclass Review",
      "content": "A summary of the advanced structures used in professional administration:\n\n- **Reporting Passives**: \"It is widely believed that...\" for objective reporting.\n- **Inversion for Emphasis**: \"Never have we faced such...\" for formal impact.\n- **Wishes & Regrets**: \"If only we had...\" for evaluating past outcomes.\n- **Mixed Conditionals**: \"If we had acted then, we would be better now.\"\n- **Advanced Modals**: \"The board must have known...\" for speculation.\n- **Nominalization**: Transforming \"We decided\" into \"The decision was made\" for formal objectivity."
    },
    {
      "id": "reporting",
      "title": "Executive Reporting & Summaries",
      "content": "Effective administration requires the ability to condense complex data into clear, actionable reports for senior leadership.\n\n- **Executive Summary**: A concise version of a larger report, highlighting key findings and recommendations.\n- **Synthesis**: Combining multiple sources of information to form a coherent argument or overview.\n- **Actionable Insights**: Findings from data that suggest a clear path forward or decision.\n- **Stakeholder Alignment**: The process of ensuring all parties involved in a project are in agreement with its goals and progress."
    },
    {
      "id": "problem-solving",
      "title": "Complex Problem Solving in Administration",
      "content": "Advanced administrators must navigate ambiguous situations and solve multi-layered problems.\n\n- **Root Cause Analysis (RCA)**: A method of problem-solving used for identifying the root causes of faults or problems.\n- **Mitigation Strategy**: A plan developed to reduce the impact of a known risk.\n- **Contingency Planning**: Preparing for alternative outcomes if the primary plan fails.\n- **Resource Allocation**: The process of assigning and managing assets in a manner that supports an organisation's strategic goals."
    },
    {
      "id": "presentation",
      "title": "Professional Presentation & Persuasion",
      "content": "Presenting findings effectively is as important as the analysis itself in high-level administration.\n\n- **Data Visualisation**: Representing data in graphical form to make it easier to understand.\n- **Persuasive Rhetoric**: Using language effectively to influence the opinions or actions of an audience.\n- **Executive Presence**: The combination of temperament, presence, and skills that allow a leader to command a room.\n- **Non-Verbal Communication**: The use of body language, gestures, and facial expressions to convey meaning during a presentation."
    }
  ],
  "objectives": [
    "Synthesise concepts from operations, finance, and strategy to solve administrative cases",
    "Utilise advanced grammar structures to draft a formal executive summary",
    "Identify and mitigate risks in international logistics and business law",
    "Demonstrate proficiency in B2-level administrative English for the workplace"
  ],
  "keyTerms": [
    { "term": "Executive Summary", "definition": "A short document or section of a document, produced for business purposes, that summarises a longer report or proposal." },
    { "term": "Audit Trail", "definition": "A step-by-step record by which data can be traced to its source." }
  ]
}