{
  "title": "Week 3: Operating Costs & Working Capital Optimization",
  "content": "# Cost Management and Working Capital\n\nEfficiency in finance is often found in the details of the Balance Sheet and the Income Statement. This week focuses on OPEX management and the optimization of working capital.\n\n## Fixed vs. Variable Costs\n- **Fixed Costs**: Expenses that do not change with the level of production (e.g., rent, salaries).\n- **Variable Costs**: Expenses that fluctuate in direct proportion to production volume (e.g., raw materials, commissions).\n\n## Working Capital Optimization\nEfficient companies manage their **Cash Conversion Cycle (CCC)** to ensure they have enough liquidity to operate without excessive borrowing.\n1. **DSO (Days Sales Outstanding)**: How long it takes to collect payments from customers.\n2. **DIO (Days Inventory Outstanding)**: How long inventory sits in the warehouse.\n3. **DPO (Days Payable Outstanding)**: How long the company takes to pay its suppliers.\n\n## CCC Equation\n`CCC = DIO + DSO - DPO` \n(A lower CCC is generally better, as it means cash is tied up for less time).\n\n## Grammar: Precision in Causality\nWhen explaining financial changes, use precise connectors:\n- *The margin compression was primarily attributable to...*\n- *The surge in accounts receivable stemmed from...*\n- *Improved DPO has consequently bolstered our cash position.*",
  "objectives": [
    "Distinguish between fixed and variable cost structures",
    "Calculate and interpret the Cash Conversion Cycle (CCC)",
    "Use sophisticated connectors to explain financial cause and effect"
  ],
  "keyTerms": [
    { "term": "Liquidity", "definition": "The availability of liquid assets to a market or company." },
    { "term": "Solvency", "definition": "The possession of assets in excess of liabilities; ability to pay one's debts." },
    { "term": "DSO", "definition": "Days Sales Outstanding; a measure of the average number of days that it takes a company to collect payment after a sale has been made." }
  ]
}
