{
  "title": "Repaso del Segundo Trimestre",
  "sections": [
    {
      "id": "review-vocab-comprehensive",
      "title": "Repaso Integral de Vocabulario (B1 Trimestre 2)",
      "content": "Durante este trimestre, hemos cubierto las operaciones financieras corporativas esenciales:\n\n1. **Operaciones y Facturación**: Ledger, Invoicing, Accounts Payable/Receivable, VAT, Tax returns.\n2. **Cumplimiento y Auditoría**: Compliance, KYC, AML, Audit trail, Due Diligence, Whistleblower.\n3. **Reportes Financieros**: P&L, Balance Sheet, Cash Flow, Revenue, OpEx, CapEx, Net Profit, Bottom line.\n4. **Mercados y Riesgos**: Forex, Exchange Rate, Hedging, Volatility, Spread, Tariffs, Customs, Trade Balance."
    },
    {
      "id": "review-grammar-comprehensive",
      "title": "Repaso de Estructuras Gramaticales Clave",
      "content": "Dominar estas estructuras es fundamental para la comunicación profesional en finanzas:\n\n- **Passive Voice**: Para describir procesos donde el objeto es más importante que el sujeto (\"The invoice **was sent**\", \"The data **is processed**\").\n- **Second Conditional**: Para análisis de escenarios hipotéticos (\"If we **had** more capital, we **would acquire** the competitor\").\n- **Reported Speech**: Para informar sobre hallazgos de auditoría o reuniones (\"The auditor said that they **had found** a red flag\").\n- **Wish**: Para expresar deseos de mejora o arrepentimientos sobre decisiones pasadas (\"I wish the rate **was** better\", \"We wish we **had invested** earlier\")."
    },
    {
      "id": "business-skills-review",
      "title": "Habilidades Profesionales",
      "content": "Hemos practicado:\n- **Writing**: Redacción de reportes cortos, emails de cumplimiento y tesis de inversión simples.\n- **Analysis**: Interpretación básica de estados financieros y tendencias de mercado.\n- **Speaking**: Presentación de hallazgos y discusión de estrategias de mitigación de riesgos."
    }
  ],
  "objectives": [
    "Consolidar el vocabulario financiero y corporativo de nivel B1",
    "Repasar todas las estructuras gramaticales complejas del trimestre",
    "Prepararse para el examen final integral"
  ],
  "keyTerms": [
    { "term": "Consolidation", "definition": "The action or process of making something stronger or more solid." },
    { "term": "Final Assessment", "definition": "The last evaluation of a course to determine the level of achievement." }
  ]
}
