{
  "title": "HR Support & Performance Reviews",
  "sections": [
    {
      "id": "recruitment-logistics",
      "title": "Recruitment & Talent Acquisition Support",
      "content": "Administrative professionals are the backbone of the recruitment process. At a B2 level, you must manage the logistics of finding and vetting talent with precision and confidentiality.\n\n### Key Recruitment Stages\n- **Job Description (JD) Refinement**: Collaborating with department heads to ensure the 'Required Skills' and 'Key Responsibilities' are accurate.\n- **Candidate Screening**: Reviewing CVs against a pre-defined checklist to create a **shortlist**.\n- **Interview Coordination**: Managing complex schedules across multiple time zones, booking rooms, and ensuring the **interview panel** has all necessary documentation.\n- **Reference Checks**: Contacting previous employers to verify a candidate's history and performance."
    },
    {
      "id": "employee-lifecycle",
      "title": "Onboarding & the Employee Lifecycle",
      "content": "A successful **induction** (onboarding) process is linked to higher employee retention. The administrator ensures the transition from 'Candidate' to 'Employee' is seamless.\n\n### Onboarding Essentials\n1. **Compliance**: Ensuring all legal paperwork, NDAs, and ID checks are completed before the start date.\n2. **Asset Provisioning**: Coordinating with IT and Facilities to ensure the new hire has a laptop, access cards, and a designated workspace.\n3. **Probationary Period**: Tracking the initial 3–6 months where the employee's performance is closely monitored before their contract is fully confirmed."
    },
    {
      "id": "performance-management",
      "title": "Performance Reviews & Appraisal Cycles",
      "content": "Most corporate environments operate on an annual or bi-annual **appraisal cycle**. Understanding the terminology is essential for documenting these meetings.\n\n### Key Concepts\n- **KPIs (Key Performance Indicators)**: Quantifiable measures used to evaluate success in reaching targets.\n- **SMART Goals**: Goals that are Specific, Measurable, Achievable, Relevant, and Time-bound.\n- **Professional Development Plan (PDP)**: A document outlining the training and growth opportunities for an employee.\n- **360-Degree Feedback**: Feedback gathered from an employee's subordinates, peers, and supervisors, as well as a self-evaluation."
    },
    {
      "id": "grammar-reported-speech",
      "title": "Grammar: Reported Speech for HR Reporting",
      "content": "In HR support, you often need to report what was said during an interview or a performance review. This requires accurate backshifting of tenses and the use of sophisticated reporting verbs.\n\n### Backshifting Rules\n- **Direct**: \"I am happy with my current targets.\"\n- **Reported**: She **stated that** she **was** happy with her targets.\n- **Direct**: \"We will increase the budget next year.\"\n- **Reported**: The board **confirmed that** they **would** increase the budget.\n\n### Sophisticated Reporting Verbs\nInstead of just using 'said' or 'told', use verbs that imply intent:\n- **To assert/claim**: \"The candidate **asserted** that they had extensive experience in SQL.\"\n- **To recommend**: \"The manager **recommended** that John attend a leadership workshop.\"\n- **To inquire**: \"They **inquired** whether the position offered remote work flexibility.\"\n- **To emphasize**: \"HR **emphasized** that the deadline for the review was non-negotiable.\""
    },
    {
      "id": "phrase-bank-hr",
      "title": "PhraseBank: Human Resources & Appraisals",
      "content": "1. **to shortlist candidates** — To select a small number of candidates from a larger group.\n2. **to fill a vacancy** — To find a person to do a job that is available.\n3. **probationary period** — A trial period for a newly recruited employee.\n4. **employee turnover** — The rate at which employees leave a company and are replaced.\n5. **to conduct an appraisal** — To perform a formal assessment of an employee.\n6. **to exceed expectations** — To do better than what was expected.\n7. **underperformance** — Failure to reach the required standard of work.\n8. **to align with goals** — To ensure actions support the company's objectives.\n9. **a high-flyer** — An employee with a lot of potential who is likely to be successful.\n10. **talent retention** — The ability of an organization to keep its employees.\n11. **to issue a warning** — To formally tell an employee their behavior/performance must improve.\n12. **disciplinary action** — Action taken by an employer against an employee for breaking rules.\n13. **gross misconduct** — Very serious unacceptable behavior that can lead to instant dismissal.\n14. **remuneration package** — The total compensation (salary, bonus, benefits) an employee receives.\n15. **to put someone on a PIP** — To put someone on a 'Performance Improvement Plan'.\n16. **to schedule an exit interview** — To meet with an employee who is leaving the company.\n17. **onboarding process** — The process of integrating a new employee into the organization.\n18. **to sign off on** — To give official approval for something (e.g., a bonus).\n19. **to meet a target** — To achieve a specific goal.\n20. **peer review** — Evaluation of work by people of similar rank/status."
    },
    {
      "id": "disciplinary-procedures",
      "title": "Disciplinary Procedures & Compliance",
      "content": "Administrative support is often required during disciplinary procedures to ensure legal compliance and accurate record-keeping.\n\n### The Disciplinary Process\n- **Formal Warning**: Issued when an employee's conduct or performance does not improve after informal coaching.\n- **Disciplinary Hearing**: A formal meeting where the employee can respond to allegations of misconduct.\n- **Gross Misconduct**: Severe violations (e.g., theft, fraud, violence) that may result in **summary dismissal** (firing without notice).\n- **Right of Appeal**: The employee’s right to challenge a disciplinary decision if they feel it was unfair."
    },
    {
      "id": "exit-interviews",
      "title": "Offboarding & Exit Interviews",
      "content": "The end of the employee lifecycle is as important as the beginning. **Offboarding** must be handled with professionalism to protect the company's reputation and security.\n\n### Offboarding Checklist\n- **Asset Retrieval**: Collecting company property (laptops, keys, credit cards).\n- **System Access**: Terminating logins and email accounts immediately upon departure.\n- **Exit Interview**: A final meeting to gather feedback on the employee’s reason for leaving. This data is critical for reducing **employee turnover**."
    },
    {
      "id": "deliverable",
      "title": "Weekly Deliverable (Portfolio)",
      "content": "### Task: HR Support Pack\n**Part 1: Candidate Shortlist Report**\nWrite a 150-word summary of 3 candidates for a 'Senior Admin' role. Use at least 4 **sophisticated reporting verbs** (asserted, recommended, etc.) to describe their interview performance.\n\n**Part 2: Performance Feedback**\nDraft a formal 100-word feedback email for an underperforming employee. Include one **SMART goal** and mention the **probationary period** or **appraisal cycle**."
    }
  ],
  "objectives": [
    "Manage the administrative logistics of recruitment and candidate screening",
    "Coordinate the onboarding process and track the employee lifecycle",
    "Apply SMART goal frameworks and KPI terminology to performance documentation",
    "Utilize advanced reported speech and reporting verbs to document professional discussions",
    "Identify and use formal HR vocabulary for appraisals and talent management"
  ],
  "keyTerms": [
    { "term": "Shortlist", "definition": "A list of selected candidates from which a final choice will be made." },
    { "term": "Appraisal", "definition": "A formal assessment, typically in a workplace, of an employee's performance over a specific period." },
    { "term": "Probation", "definition": "A process or period of testing the character or abilities of a person in a new job." },
    { "term": "Retention", "definition": "The continued possession, use, or control of something; in HR, the ability to keep employees." },
    { "term": "KPI", "definition": "Key Performance Indicator; a quantifiable measure used to evaluate success." }
  ]
}
