{
  "title": "Facility Management & Health & Safety",
  "sections": [
    {
      "id": "facility-mgmt",
      "title": "Managing the Physical Workspace",
      "content": "Facility management (FM) is an organisational function which integrates people, place, and process within the built environment with the purpose of improving the quality of life of people and the productivity of the core business.\n\n### Key FM Areas:\n- **Space Planning**: Optimising the office layout for collaboration and efficiency.\n- **Maintenance**: Managing repairs and ensuring systems (HVAC, fire safety) are operational.\n- **Health & Safety (H&S)**: Ensuring the workplace complies with legal regulations (e.g., HSE in the UK).\n- **Sustainability**: Reducing the environmental impact of the facility (waste management, energy efficiency)."
    },
    {
      "id": "phrase-bank",
      "title": "PhraseBank: FM & H&S Chunks",
      "content": "Use these chunks to discuss facilities and safety professionally:\n\n1. **to ensure compliance with** — \"We must ensure compliance with latest H&S regulations.\"\n2. **to conduct a risk assessment** — \"It is mandatory to conduct a risk assessment for all new equipment.\"\n3. **to report a hazard** — \"Please report any hazards to the facility manager immediately.\"\n4. **to schedule maintenance** — \"We've scheduled maintenance for the lifts this weekend.\"\n5. **to implement a desk-sharing policy** — \"The company is implementing a desk-sharing policy to save space.\"\n6. **to evacuate the building** — \"In the event of a fire, evacuate the building through the nearest exit.\"\n7. **to designate a fire warden** — \"Each floor must have a designated fire warden.\"\n8. **to oversee a renovation** — \"The admin team is overseeing the office renovation project.\""
    },
    {
      "id": "grammar-imperatives",
      "title": "Grammar: Formal Imperatives & Instructions",
      "content": "When providing safety instructions or facility guidelines, we use a range of formal imperative structures and modal verbs of obligation.\n\n### Direct Imperatives (Standard)\n- **Ensure** that all fire exits remain clear.\n- **Do not use** the lifts in the event of a fire.\n\n### Formal Passive Imperatives (Common in Notices)\n- **Smoking is strictly prohibited** on the premises.\n- **ID badges must be worn** at all times.\n\n### Obligation & Permission Modals\n- **Must/Shall**: *All staff shall attend the mandatory safety briefing.* (Formal obligation)\n- **Should**: *Visitors should sign in at reception.* (Strong recommendation)\n- **May not**: *Guests may not enter the server room without an escort.* (Formal prohibition)"
    },
    {
      "id": "deliverable",
      "title": "Weekly Deliverable: Health & Safety Notice",
      "content": "Draft a formal 'Health & Safety Notice' for the office kitchen or communal area. Include:\n1. **Purpose of the notice**.\n2. **List of rules and safety guidelines** (Using formal imperatives: *Ensure..., Do not...*).\n3. **Instructions for reporting issues**.\n4. **Contact details of the H&S officer**."
    }
  ],
  "objectives": [
    "Identify the core responsibilities of facility management",
    "Describe key health and safety procedures in a corporate environment",
    "Use formal imperatives and modals of obligation for instructions",
    "Conduct a basic office risk assessment and report hazards correctly"
  ],
  "keyTerms": [
    { "term": "HSE", "definition": "Health and Safety Executive: the UK government agency responsible for the encouragement, regulation, and enforcement of workplace health, safety, and welfare." },
    { "term": "Hazard", "definition": "A potential source of danger or harm." },
    { "term": "Risk Assessment", "definition": "A systematic process of evaluating the potential risks that may be involved in a projected activity or undertaking." },
    { "term": "Evacuation", "definition": "The action of leaving a person or place, especially a dangerous one, in an organized way." }
  ]
}
