{
  "title": "Stakeholder Management & Networking",
  "sections": [
    {
      "id": "stakeholder-engagement",
      "title": "Identifying and Engaging Stakeholders",
      "content": "A stakeholder is any individual or group who has an interest in or is affected by a project. Effective administration requires identifying these people early and managing their expectations.\n\n### Stakeholder Mapping\nWe often categorise stakeholders using a matrix of **Power** vs. **Interest**:\n- **High Power, High Interest**: Manage closely. These are your key players.\n- **High Power, Low Interest**: Keep satisfied. They have influence but are not deeply involved.\n- **Low Power, High Interest**: Keep informed. They care about the outcome but have little influence.\n- **Low Power, Low Interest**: Monitor only.\n\n### Engagement Strategies\n- **Consultation**: Asking for opinions before making a decision.\n- **Collaboration**: Working together to reach a common goal.\n- **Transparency**: Sharing information openly to build trust."
    },
    {
      "id": "networking-etiquette",
      "title": "Professional Networking in a UK Context",
      "content": "Networking is the process of developing and maintaining professional relationships. In the UK, this is often characterized by a blend of politeness, indirectness, and 'small talk'.\n\n### Networking Vocabulary\n- **To reach out**: To make contact with someone.\n- **To follow up**: To maintain contact after an initial meeting.\n- **To leverage**: To use something (like a connection) to maximum advantage.\n- **Mutual Benefit**: A situation where both parties gain something from the relationship.\n- **Elevator Pitch**: A concise, persuasive summary of who you are and what you do."
    },
    {
      "id": "grammar-relative-clauses",
      "title": "Grammar: Relative Clauses for Precision",
      "content": "Relative clauses allow you to provide essential or extra information about people and things without starting a new sentence. This makes your communication more sophisticated and precise.\n\n### Defining Relative Clauses\nProvide essential information. Without them, the sentence doesn't make sense. No commas.\n- *\"The stakeholder **who** has the most influence is the Finance Director.\"*\n- *\"The report **that** I sent yesterday contains the stakeholder map.\"*\n\n### Non-Defining Relative Clauses\nProvide extra, non-essential information. We use commas.\n- *\"Mr. Henderson, **who** is the CEO of the company, will be attending the meeting.\"*\n- *\"The new project, **which** was approved last week, focuses on stakeholder engagement.\"*\n\n### Relative Pronouns\n- **Who**: People.\n- **Which**: Things.\n- **That**: People or things (Defining only).\n- **Whose**: Possession.\n- **Whom**: People (formal, as the object of a verb or preposition)."
    },
    {
      "id": "professional-phrasing",
      "title": "Professional Phrasing for Networking",
      "content": "- \"I am **reaching out** to discuss a potential collaboration.\"\n- \"It was a pleasure meeting you; I will **follow up** with the documents shortly.\"\n- \"We should **leverage** our existing connections to find a new vendor.\"\n- \"Our goal is to ensure a **mutually beneficial** outcome for all stakeholders.\""
    }
  ],
  "objectives": [
    "Categorise stakeholders based on power and interest",
    "Apply networking etiquette in formal professional contexts",
    "Use defining and non-defining relative clauses to specify details",
    "Develop a professional elevator pitch"
  ],
  "keyTerms": [
    { "term": "Stakeholder", "definition": "A person with an interest or concern in something, especially a business." },
    { "term": "Networking", "definition": "The action or process of interacting with others to exchange information and develop professional or social contacts." },
    { "term": "Leverage", "definition": "Use (something) to maximum advantage." },
    { "term": "Follow-up", "definition": "A further action connected with something that happened before." }
  ]
}