{
  "title": "Macroeconomic Analysis & Forecasting",
  "sections": [
    {
      "id": "macro-theory",
      "title": "Economic Schools of Thought & Policy",
      "content": "Understanding the theoretical basis of economic policy is essential for high-level forecasting.\n\n- **Keynesian Economics**: The theory that government spending and lower taxes can stimulate demand and pull an economy out of a recession.\n- **Monetarism**: An economic theory that focuses on the macroeconomic effects of the supply of money and central banking.\n- **Supply-Side Economics**: The theory that economic growth can be most effectively created by lowering taxes and decreasing regulation.\n- **Quantitative Tightening (QT)**: A contractionary monetary policy used by central banks to decrease the amount of liquidity or money supply in the economy."
    },
    {
      "id": "forecasting-indicators",
      "title": "Advanced Economic Indicators",
      "content": "Analysts use leading and lagging indicators to predict market shifts.\n\n- **Leading Indicators**: Factors that change before the economy as a whole changes (e.g., stock market returns, building permits).\n- **Lagging Indicators**: Factors that change after the economy as a whole changes (e.g., unemployment rate, GDP).\n- **Yield Curve Inversion**: When short-term interest rates exceed long-term rates; historically a reliable predictor of a recession.\n- **Purchasing Managers' Index (PMI)**: An index of the prevailing direction of economic trends in the manufacturing and service sectors."
    },
    {
      "id": "grammar-causality-result",
      "title": "Language Focus: Expressing Complex Causality & Result",
      "content": "C1 level requires the ability to link multiple economic events into a logical chain.\n\n- **Linking Causality**: \n  - 'The hike in rates **stemmed from** concerns over runaway inflation.'\n  - '**Given** the current fiscal deficit, a tax hike is virtually inevitable.'\n- **Expressing Result**: \n  - 'The policy change **gave rise to** a surge in foreign investment.'\n  - 'The intervention was successful, **thereby** averting a total market collapse.'"
    }
  ],
  "objectives": [
    "Compare and contrast major macroeconomic theories (Keynesianism vs. Monetarism)",
    "Interpret complex indicators like the yield curve and PMI for market forecasting",
    "Utilize advanced cohesive devices to explain chains of causality in economic reports"
  ],
  "keyTerms": [
    { "term": "Hyperinflation", "definition": "Extremely rapid or out-of-control inflation." },
    { "term": "Stagflation", "definition": "Persistent high inflation combined with high unemployment and stagnant demand in a country's economy." }
  ]
}