{
  "title": "Project Management Fundamentals",
  "sections": [
    {
      "id": "project-lifecycle",
      "title": "The Project Lifecycle: From Initiation to Closure",
      "content": "Project management is the application of processes, methods, and skills to achieve specific project objectives according to acceptance criteria within agreed parameters. Most projects follow a structured four-phase lifecycle:\n\n### 1. Initiation Phase\nThis is where the project is defined. Administrators often help draft the **Project Charter**, a document that formally authorises the project and outlines its scope and objectives. Key stakeholders are identified, and a **feasibility study** may be conducted.\n\n### 2. Planning Phase\nIn this phase, a detailed roadmap is created. This includes defining **milestones**, creating a **Gantt Chart** for scheduling, and performing **resource allocation**. It is crucial to set clear **KPIs** to measure success later.\n\n### 3. Execution & Monitoring Phase\nThe actual work is carried out. This phase often overlaps with **Monitoring and Control**, where administrators track progress against the plan to ensure the project doesn't **run over** budget or **fall behind** schedule. Managing **scope creep** (unauthorised changes to the project scope) is a primary task here.\n\n### 4. Closure Phase\nThe final deliverables are handed over. The team conducts a **Post-Mortem** or 'Lessons Learned' session to evaluate what went well and what could be improved for future projects."
    },
    {
      "id": "methodologies",
      "title": "Administrative Methodologies: Waterfall vs. Agile",
      "content": "Administrators must adapt to different project management styles depending on the industry and project type:\n\n- **Waterfall**: A linear approach where each phase must be completed before the next begins. It is highly structured and predictable, ideal for construction or fixed-budget corporate projects.\n- **Agile**: An iterative approach where the project is broken into small chunks called **Sprints**. It allows for flexibility and continuous feedback, commonly used in software development and marketing."
    },
    {
      "id": "grammar-future-tenses",
      "title": "Grammar: Advanced Future Tenses for Forecasting",
      "content": "Precise communication about timelines is essential for project managers. We use specific future tenses to describe different types of completion and duration.\n\n### Future Continuous (Will be + -ing)\nUsed for actions that will be in progress at a specific moment in the future.\n- *\"At this time next week, the team **will be conducting** the UAT.\"*\n- *\"We **will be monitoring** the budget throughout the execution phase.\"*\n\n### Future Perfect (Will have + past participle)\nUsed for actions that will be finished **before** a specific point in the future. Perfect for deadlines.\n- *\"By the end of the month, we **will have finalised** the project charter.\"*\n- *\"The vendors **will have delivered** the hardware by Monday.\"*\n\n### Future Perfect Continuous (Will have been + -ing)\nUsed to show how long an action will have been in progress at a certain point in the future.\n- *\"By December, I **will have been managing** this project for six months.\"*\n- *\"The engineers **will have been testing** the system for 48 hours before it goes live.\""
    },
    {
      "id": "project-phrasal-verbs",
      "title": "Phrasal Verbs for Project Tracking",
      "content": "Effective project updates often use these idiomatic expressions:\n\n- **To fall behind**: To fail to keep up with a schedule. (*\"We've **fallen behind** on the documentation phase.\"*)\n- **To catch up**: To reach the same level or point as the schedule. (*\"We'll need to work overtime to **catch up** with the deadline.\"*)\n- **To run over**: To exceed a limit (time or budget). (*\"The project is likely to **run over** by two weeks.\"*)\n- **To sign off on**: To give official approval. (*\"The CEO has finally **signed off on** the budget reallocation.\"*)\n- **To follow through**: To complete an initial action. (*\"We must **follow through** on our commitment to stakeholders.\""
    }
  ],
  "objectives": [
    "Differentiate between Waterfall and Agile methodologies in a corporate context",
    "Identify the components of a Project Charter during the initiation phase",
    "Master the use of Future Perfect and Future Continuous for project forecasting",
    "Apply phrasal verbs for status reporting and timeline management",
    "Define and mitigate scope creep and resource bottlenecks"
  ],
  "keyTerms": [
    { "term": "Project Charter", "definition": "A formal document that defines the scope, objectives, and participants in a project." },
    { "term": "Sprint", "definition": "A set period of time during which specific work has to be completed and made ready for review." },
    { "term": "Scope Creep", "definition": "Changes, continuous or uncontrolled growth in a project’s scope, at any point after the project begins." },
    { "term": "Post-Mortem", "definition": "An analysis of a project after its completion to examine what was successful and what was not." },
    { "term": "Contingency Plan", "definition": "A plan designed to take account of a possible future event or circumstance." }
  ]
}