{
  "title": "Project Management Fundamentals",
  "sections": [
    {
      "id": "project-lifecycle",
      "title": "The Four Phases of a Project",
      "content": "A project is a temporary endeavour with a defined beginning and end. Managing it requires a structured approach across four main phases:\n\n1. **Initiation**: Defining the project's purpose, feasibility, and key stakeholders.\n2. **Planning**: Creating a roadmap, setting deadlines, and allocating resources.\n3. **Execution**: Carrying out the work and monitoring progress.\n4. **Closure**: Finalising all activities, handing over deliverables, and reviewing lessons learned.\n\n### Key Concepts\n- **Deliverable**: A tangible or intangible product or service produced as a result of the project.\n- **Scope Creep**: When a project's requirements extend beyond the original plan without a corresponding increase in time or budget.\n- **KPI (Key Performance Indicator)**: A measurable value that demonstrates how effectively a company is achieving key business objectives."
    },
    {
      "id": "milestones-tracking",
      "title": "Milestones and Task Allocation",
      "content": "To keep a project on track, administrators use milestones and specific task assignments.\n\n### Project Tracking Vocabulary\n- **Milestone**: A significant point or event in a project (e.g., signing a contract or completing a prototype).\n- **Gantt Chart**: A type of bar chart that illustrates a project schedule.\n- **Bottleneck**: As seen in previous weeks, a point where work is delayed.\n- **To delegate**: To entrust a task or responsibility to another person."
    },
    {
      "id": "grammar-future-tenses",
      "title": "Grammar: Future Perfect & Future Continuous",
      "content": "In project management, we use these tenses to discuss progress and expectations regarding deadlines.\n\n### Future Continuous (Will be + -ing)\nUsed to describe an action that will be in progress at a specific time in the future.\n- *\"By 2 PM tomorrow, we **will be conducting** the stakeholder interviews.\"*\n- *\"Next month, the team **will be working** on the final deliverables.\"*\n\n### Future Perfect (Will have + past participle)\nUsed to describe an action that will be completed before a specific point in the future. Essential for discussing deadlines.\n- *\"By Friday afternoon, we **will have finished** the project plan.\"*\n- *\"I hope that by next week, the client **will have approved** the budget.\"*\n\n### Comparison\n- *\"At 5 PM, I **will be finishing** the report.\"* (I am in the process of finishing it).\n- *\"By 5 PM, I **will have finished** the report.\"* (The report is already done)."
    },
    {
      "id": "professional-phrasing",
      "title": "Professional Phrasing for Project Updates",
      "content": "- \"We are currently in the **execution phase** of the project.\"\n- \"To avoid **scope creep**, we must strictly adhere to the original brief.\"\n- \"By the end of the quarter, we **will have achieved** all our **KPIs**.\"\n- \"I'll **be monitoring** the project's progress via the **Gantt chart**.\""
    }
  ],
  "objectives": [
    "Identify and describe the four phases of a project lifecycle",
    "Define key project management terms (KPIs, deliverables, scope creep)",
    "Use Future Continuous to describe ongoing future activities",
    "Use Future Perfect to state deadlines and expected completion points"
  ],
  "keyTerms": [
    { "term": "Deliverable", "definition": "A thing able to be provided, especially as a product of a development process." },
    { "term": "KPI", "definition": "Key Performance Indicator: a quantifiable measure used to evaluate the success of an organization." },
    { "term": "Milestone", "definition": "A significant stage or event in the development of something." },
    { "term": "Scope Creep", "definition": "The uncontrolled expansion to product or project scope without adjustments to time, cost, and resources." }
  ]
}