{
  "course": {
    "language_ui": "es-ES",
    "target_language": "en",
    "level": "B1",
    "unit_id": "U38",
    "unit_title": "Unit 38",
    "total_duration_minutes": 600
  },
  "learning_outcomes": [],
  "mastery_tags": [],
  "blocks": [
    {
      "block_id": "B1",
      "title": "Articles and Reviews",
      "duration_minutes": 20,
      "content": [
        {
          "interaction_id": "B1_U38_B1_I1",
          "type": "fill_blanks",
          "prompt_es": "Fill in the blanks with the correct words to complete the text about articles and reviews.",
          "mastery_tag": "reading:b1-articles-reviews",
          "main_text": "In today's world, people often rely on (1)___ to make informed decisions. Many readers look for (2)___ that provide detailed opinions on various products, services, or experiences. A good article should present a clear (3)___, supported by evidence and examples. Readers appreciate when the (4)___ is engaging and well-organized to maintain their interest. Ultimately, a well-crafted review can significantly influence (5)___ choices.",
          "correct_answer": [
            "reviews",
            "articles",
            "argument",
            "writing",
            "consumer"
          ],
          "explanation": "(1) La palabra correcta es 'reviews', ya que se refiere a las revisiones o críticas que la gente lee.\n(2) La palabra 'articles' es correcta porque se refiere a los textos que brindan información y opiniones.\n(3) Aquí se requiere la palabra 'argument', que describe el punto principal que se defiende en el artículo.\n(4) La palabra 'writing' es necesaria para describir el estilo en que se presenta el contenido.\n(5) La palabra correcta es 'consumer', que describe a la persona que toma decisiones de compra.",
          "complexity": 2,
          "concept_tags": [
            "reading",
            "articles",
            "reviews",
            "unit"
          ]
        }
      ]
    },
    {
      "block_id": "B2",
      "title": "Expressing Opinions",
      "duration_minutes": 20,
      "content": [
        {
          "interaction_id": "B1_U38_B2_I1",
          "type": "fill_blanks",
          "prompt_es": "Complete the sentences with the most appropriate words or phrases to express opinions.",
          "mastery_tag": "speaking:b1-expressing-opinions",
          "main_text": "In my opinion, watching movies in the original language is ___ because you understand the culture better.",
          "correct_answer": [
            "important",
            "believe",
            "argue",
            "feel",
            "recognize"
          ],
          "explanation": "(1) Se trata de dar una opinión sobre la importancia de ver películas en su idioma original, lo cual ayuda a entender mejor la cultura.\n(2) Aquí se necesita una palabra que exprese la creencia del hablante sobre el impacto negativo de las redes sociales.\n(3) El verbo 'argue' se usa para expresar que muchas personas sostienen un punto de vista sobre la educación gratuita.\n(4) El uso de 'feel' aquí muestra que, a pesar de entender el punto de vista de la otra persona, se mantiene una opinión diferente.\n(5) La palabra 'recognize' se utiliza para indicar que las personas son conscientes del impacto del cambio climático.",
          "complexity": 2,
          "concept_tags": [
            "speaking",
            "expressing",
            "opinions",
            "unit"
          ]
        }
      ]
    },
    {
      "block_id": "B3",
      "title": "Simple Stories and Narratives",
      "duration_minutes": 20,
      "content": [
        {
          "interaction_id": "B1_U38_B3_I1",
          "type": "fill_blanks",
          "prompt_es": "Complete the sentences with the correct words.",
          "mastery_tag": "writing:b1-stories",
          "main_text": "Once upon a time, in a small village, there lived a young girl named Lily. Every morning, she (1)___ to the forest to gather flowers. One day, while she (2)___ some beautiful bluebells, she heard a strange noise. Curious, she (3)___ closer to see what it was. To her surprise, she (4)___ a small rabbit trapped in a bush. Lily quickly (5)___ the rabbit free, and they became good friends.",
          "correct_answer": [
            "went",
            "was picking",
            "moved",
            "found",
            "set"
          ],
          "explanation": "(1) Se usa el pasado simple 'went' porque es una acción completa en el pasado.\n(2) Usamos el pasado continuo 'was picking' porque describe una acción en progreso en el pasado.\n(3) El pasado simple 'moved' se usa para describir una acción completa que ocurrió en el pasado.\n(4) Usamos el pasado simple 'found' porque describe una acción que tuvo lugar en el pasado.\n(5) El pasado simple 'set' se usa aquí como la acción de liberar al conejo.",
          "complexity": 2,
          "concept_tags": [
            "writing",
            "stories",
            "unit"
          ]
        }
      ]
    }
  ]
}