{
  "title": "Investment Basics: Stocks & Bonds",
  "sections": [
    {
      "id": "intro-invest",
      "title": "Understanding Securities",
      "content": "Investing is the act of allocating resources, usually money, with the expectation of generating an income or profit.\n\n- **Security**: A tradable financial asset (shares, bonds).\n- **Equity / Stocks / Shares**: Units of ownership in a company. If the company grows, the share value increases.\n- **Dividends**: A portion of a company's profit paid to shareholders.\n- **Bonds**: Debt instruments where you lend money to an organization (government or corporate) for a fixed period at a fixed interest rate.\n- **Maturity**: The date when a bond must be repaid.\n- **Portfolio**: A collection of financial investments held by an individual or institution."
    },
    {
      "id": "risk-reward",
      "title": "Risk and Return",
      "content": "The fundamental principle of investing is the relationship between risk and reward:\n\n- **Asset Allocation**: Dividing an investment portfolio among different asset categories (stocks, bonds, cash).\n- **Diversification**: Spreading investments to reduce risk (\"Don't put all your eggs in one basket\").\n- **Volatility**: The rate at which the price of a security increases or decreases.\n- **Bull Market**: A market where prices are rising or expected to rise.\n- **Bear Market**: A market where prices are falling."
    },
    {
      "id": "grammar-conditionals",
      "title": "Grammar Focus: First Conditional",
      "content": "We use the first conditional to talk about real possibilities and their consequences in the future market.\n\n- If the stock price **rises**, I **will sell** my shares. (Si el precio de la acción sube, venderé mis acciones).\n- If the interest rates **go up**, bond prices **will fall**. (Si los tipos de interés suben, los precios de los bonos caerán).\n- We **will not invest** if the risk **is** too high. (No invertiremos si el riesgo es demasiado alto).\n\n**Structure**: If + **Present Simple**, + **Will** + verb."
    },
    {
      "id": "vocabulary_summary",
      "title": "Vocabulary Summary",
      "content": "| English | Spanish |\n| :--- | :--- |\n| **Shareholder** | Accionista |\n| **Stock Exchange** | Bolsa de valores |\n| **Blue-chip stocks** | Acciones de empresas consolidadas |\n| **Yield** | Rendimiento / Rentabilidad |\n| **Capital Gain** | Plusvalía / Ganancia de capital |\n| **Broker** | Corredor de bolsa / Bróker |\n| **Fixed Income** | Renta fija (Bonds) |"
    }
  ],
  "objectives": [
    "Differentiate between equity (stocks) and debt (bonds) investments",
    "Understand the concepts of diversification and risk management",
    "Use the first conditional to predict market outcomes"
  ],
  "keyTerms": [
    { "term": "Equity", "definition": "Ownership interest in a corporation in the form of common stock or preferred stock." },
    { "term": "Bond", "definition": "A fixed income instrument that represents a loan made by an investor to a borrower." }
  ]
}
