{
  "title": "Global Compliance & Final Assessment",
  "sections": [
    {
      "id": "regulatory-frameworks",
      "title": "Global Regulatory Compliance",
      "content": "Understanding the frameworks that stabilize the global financial system is critical for senior management.\n\n- **Basel III**: A global, voluntary regulatory framework on bank capital adequacy, stress testing, and market liquidity risk. It aims to strengthen the regulation, supervision, and risk management of the banking sector.\n- **Solvency II**: A directive in EU law that codifies and harmonizes the EU insurance regulation. Primarily concerned with the amount of capital that EU insurance companies must hold to reduce the risk of insolvency.\n- **Tier 1 Capital**: The core measure of a bank's financial strength from a regulator's point of view, consisting primarily of common stock and disclosed reserves.\n- **Liquidity Coverage Ratio (LCR)**: Requires banks to hold enough high-quality liquid assets to survive a 30-day stress scenario.\n- **Stress Testing**: Simulation techniques used on asset and liability portfolios to determine their reactions to different financial scenarios."
    },
    {
      "id": "exam-prep",
      "title": "Final Assessment Strategy",
      "content": "The final exam covers all topics from Weeks 13-23. Focus on:\n\n- **Precision**: Using the correct financial terminology (e.g., *fiduciary duty* vs *stewardship*).\n- **Nuance**: Mastering hedging language to manage liability in executive communication.\n- **Authority**: Using inversion and rhetorical devices to lead negotiations and presentations.\n- **Integration**: Connecting technical concepts (like Swaps or DCF) with strategic governance and ESG goals."
    }
  ],
  "objectives": [
    "Master global regulatory terminology and compliance frameworks",
    "Successfully navigate the comprehensive C1 Trimester 2 final assessment",
    "Demonstrate executive-level proficiency in financial English and strategic communication"
  ],
  "keyTerms": [
    { "term": "Capital Adequacy", "definition": "The statutory minimum reserves of capital that a bank or other financial institution must have available." },
    { "term": "Systemically Important Financial Institution (SIFI)", "definition": "A bank, insurance company, or other financial institution whose failure might trigger a financial crisis." },
    { "term": "Compliance Oversight", "definition": "The process of ensuring that a company follows relevant laws, regulations, and business rules." }
  ]
}
