{
  "title": "Cumplimiento Regulatorio Global",
  "sections": [
    {
      "id": "vocab",
      "title": "Basel III and Solvency II",
      "content": "Los marcos regulatorios aseguran la estabilidad del sistema financiero global.\n\n- **Basel III**: Marco regulatorio global sobre la adecuación del capital de los bancos.\n- **Solvency II**: Directiva de la UE para regular la industria de seguros.\n- **Tier 1 Capital**: Capital de máxima calidad (acciones y reservas).\n- **Liquidity Coverage Ratio (LCR)**: Ratio de cobertura de liquidez.\n- **Stress Testing**: Pruebas de resistencia (simulación de escenarios económicos adversos).\n- **Compliance Risk**: Riesgo de cumplimiento (riesgo de sanciones legales o regulatorias)."
    },
    {
      "id": "grammar",
      "title": "Precision and Nuance in Regulatory Language",
      "content": "En el cumplimiento regulatorio, el uso preciso de verbos modales y estructuras es crítico.\n\n**Obligación vs Recomendación:**\n- **Shall**: Indica obligación legal estricta en contratos. (e.g., *The bank shall maintain a Tier 1 ratio of 8%.*)\n- **Should**: Indica recomendación o mejor práctica. (e.g., *Financial institutions should conduct stress tests annually.*)\n\n**Condicionales para Impacto Regulatorio:**\n- **Unless otherwise specified**: A menos que se especifique lo contrario.\n- **Provided that**: Siempre que / Con la condición de que. (e.g., *Dividends can be paid provided that the capital buffer is met.*)"
    }
  ],
  "objectives": [
    "Comprender los requisitos de capital de Basel III",
    "Analizar el impacto de Solvency II en las aseguradoras",
    "Distinguir entre mandatos legales y recomendaciones en textos regulatorios"
  ],
  "keyTerms": [
    { "term": "Regulatory Capital", "definition": "The amount of capital a bank or other financial institution has to hold as required by its financial regulator." },
    { "term": "Systemic Risk", "definition": "The risk of collapse of an entire financial system or entire market." }
  ]
}
