{
  "course": {
    "language_ui": "es-ES",
    "target_language": "en",
    "level": "B2",
    "unit_id": "U25",
    "unit_title": "Unit 25",
    "total_duration_minutes": 600
  },
  "learning_outcomes": [],
  "mastery_tags": [],
  "blocks": [
    {
      "block_id": "B1",
      "title": "Idiomatic Expressions",
      "duration_minutes": 20,
      "content": [
        {
          "interaction_id": "B2_U25_B1_I1",
          "type": "fill_blanks",
          "prompt_es": "Fill in the blanks with the correct form of the word provided in parentheses.\n\nBase words: (1) ACT, (2) COMMUNICATE, (3) HEALTH, (4) COLOR, (5) NATIVE",
          "mastery_tag": "vocabulary:b2-idiomatic",
          "main_text": "Idioms are an important part of the English language. They often (1)___ (ACT) in a way that is not literal. Understanding idioms can greatly improve your (2)___ (COMMUNICATE) skills. For example, when someone says they are 'feeling under the weather,' they mean they are not (3)___ (HEALTH) or they are sick. Using idiomatic expressions can make your speech more (4)___ (COLOR) and engaging. Additionally, it helps you to sound more like a (5)___ (NATIVE) speaker.",
          "correct_answer": [
            "ACTS",
            "COMMUNICATION",
            "HEALTHY",
            "COLORFUL",
            "NATIVES"
          ],
          "explanation": "(1) undefined\n(2) undefined\n(3) undefined\n(4) undefined\n(5) undefined",
          "complexity": 3,
          "concept_tags": [
            "vocabulary",
            "idiomatic",
            "unit"
          ]
        }
      ]
    },
    {
      "block_id": "B2",
      "title": "Debate and Discussion",
      "duration_minutes": 20,
      "content": [
        {
          "interaction_id": "B2_U25_B2_I1",
          "type": "fill_blanks",
          "prompt_es": "Fill in the blanks with the correct words related to debate and discussion.",
          "mastery_tag": "speaking:b2-debate",
          "main_text": "During a debate, it is important to (1)___ your arguments clearly and effectively.",
          "correct_answer": [
            "articulate",
            "support",
            "acknowledge",
            "rehearse",
            "flexible"
          ],
          "explanation": "(1) Es importante expresar tus argumentos de manera clara y efectiva durante un debate.\n(2) Un buen debatiente debe poder respaldar su punto de vista con pruebas sólidas.\n(3) Es esencial reconocer las opiniones opuestas de manera respetuosa para mantener una discusión constructiva.\n(4) En un debate formal, los participantes a menudo practican sus ideas antes de presentarlas al público.\n(5) Para tener éxito en una discusión, uno debe ser flexible y estar abierto a diferentes perspectivas.",
          "complexity": 3,
          "concept_tags": [
            "speaking",
            "debate",
            "unit"
          ]
        }
      ]
    },
    {
      "block_id": "B3",
      "title": "Lectures and Presentations",
      "duration_minutes": 20,
      "content": [
        {
          "interaction_id": "B2_U25_B3_I1",
          "type": "fill_blanks",
          "prompt_es": "Complete the sentences by filling in the blanks with the most appropriate words.",
          "mastery_tag": "listening:b2-lectures",
          "main_text": "In an academic setting, delivering a successful lecture requires careful planning and consideration of the audience's needs. A good lecturer often starts with a clear (1)___ to outline the main points of the talk. Engaging the audience is crucial; therefore, using (2)___ can make complex topics more relatable. Additionally, it is important to (3)___ time for questions at the end of the presentation to clarify any doubts. Effective use of (4)___ aids like slides and visual representations can enhance understanding. Finally, practicing the delivery of the lecture is essential to ensure smooth (5)___ and confidence.",
          "correct_answer": [
            "outline",
            "examples",
            "allocate",
            "visual",
            "flow"
          ],
          "explanation": "(1) La palabra 'outline' significa un resumen o esquema de los puntos principales que se van a tratar en la charla.\n(2) Los 'examples' ayudan a los oyentes a entender mejor conceptos difíciles al proporcionar ilustraciones claras.\n(3) Al 'allocate' tiempo, el presentador permite a la audiencia expresar sus dudas, lo que mejora la metodología de enseñanza.\n(4) Los 'visual aids' se refieren a herramientas como gráficos o diapositivas que ayudan a clarificar y enfatizar el contenido.\n(5) La 'flow' de la presentación se refiere a la fluidez y coherencia del discurso, crucial para mantener la atención del público.",
          "complexity": 3,
          "concept_tags": [
            "listening",
            "lectures",
            "unit"
          ]
        }
      ]
    }
  ]
}