{
  "title": "International Business & Logistics",
  "sections": [
    {
      "id": "vocab",
      "title": "Global Trade & Operations",
      "content": "International business requires a deep understanding of global supply chains, trade regulations, and logistical efficiency.\n\n- **Incoterms**: A set of 11 individual rules issued by the International Chamber of Commerce (ICC) which define the responsibilities of sellers and buyers for the sale of goods in international transactions.\n- **Customs Clearance**: The process of passing goods through customs so that they can enter or leave a country.\n- **Freight Forwarding**: A service used by companies that import and export goods, arranging the storage and shipping of merchandise on behalf of its shippers.\n- **Lead Time**: The amount of time that elapses between when a process starts and when it is completed (e.g., from order placement to delivery).\n- **Economies of Scale**: The cost advantages that enterprises obtain due to their scale of operation, with cost per unit of output decreasing which allows fixed costs to be spread over more units of output.\n- **Trade Barriers**: Government-induced restrictions on international trade, such as tariffs, quotas, and embargoes."
    },
    {
      "id": "grammar",
      "title": "Concession & Contrast",
      "content": "Advanced concession and contrast structures allow for nuanced arguments in business reports and negotiations.\n\n- **Albeit**: Means 'although' or 'even though', usually followed by an adjective or a phrase, not a full clause.\n  *Example:* \"The project was successful, **albeit** slightly over budget.\"\n- **Notwithstanding**: Means 'despite' or 'in spite of'. It can be used before or after the noun it modifies.\n  *Example:* \"**Notwithstanding** the logistical delays, the shipment arrived on time.\"\n- **Much as**: Used like 'although' to emphasize a strong contrast.\n  *Example:* \"**Much as** we would like to expand into Asia, the current economic climate is too volatile.\"\n- **Even so**: Used to introduce a statement that contrasts with what was just said (similar to 'nevertheless').\n  *Example:* \"The tariffs have increased. **Even so**, our sales remain strong.\"\n- **In spite of / Despite**: Followed by a noun or -ing form.\n  *Example:* \"**Despite** the trade barriers, we achieved record exports.\""
    }
  ],
  "objectives": [
    "Identify the correct Incoterm for a specific international shipment",
    "Calculate 'lead time' and identify bottlenecks in a logistical process",
    "Use 'albeit' and 'notwithstanding' to add nuance to professional reports",
    "Discuss the impact of trade barriers on an organisation's global strategy"
  ],
  "keyTerms": [
    { "term": "Consignment", "definition": "A batch of goods destined for or delivered to someone." },
    { "term": "Tariff", "definition": "A tax or duty to be paid on a particular class of imports or exports." }
  ]
}