{
  "title": "Gestión de Cuentas Bancarias y Transacciones",
  "sections": [
    {
      "id": "intro",
      "title": "Introducción a los Tipos de Cuentas",
      "content": "En el sector financiero, es fundamental distinguir entre los diferentes tipos de cuentas que un cliente puede abrir. Las dos más comunes son:\n\n1. **Current Account** (Cuenta Corriente): Diseñada para el uso diario, pagos y depósitos frecuentes. Suele incluir una tarjeta de débito y acceso a banca online.\n2. **Savings Account** (Cuenta de Ahorros): Pensada para acumular dinero a largo plazo, generalmente con una tasa de interés más alta pero con límites en el número de retiradas mensuales.\n\nOtros conceptos clave:\n- **Overdraft**: Permiso para gastar más dinero del que hay en la cuenta (saldo negativo).\n- **Interest Rate**: El porcentaje que el banco paga por los ahorros o cobra por los préstamos.\n- **Joint Account**: Una cuenta compartida por dos o más personas.\n- **Fixed-term Deposit**: Un depósito de dinero que no se puede retirar durante un tiempo determinado a cambio de un interés fijo."
    },
    {
      "id": "transactions",
      "title": "Tipos de Transacciones Bancarias",
      "content": "Para gestionar el flujo de caja de los clientes, debemos conocer los métodos de pago habituales:\n\n- **Standing Order**: Una instrucción permanente para pagar una cantidad **fija** a intervalos regulares (ej. el alquiler).\n- **Direct Debit**: Autorización a un tercero para que retire cantidades **variables** de nuestra cuenta (ej. facturas de luz o teléfono).\n- **Wire Transfer**: Transferencia electrónica de fondos, común en transacciones internacionales.\n- **Direct Deposit**: Cuando el salario se ingresa directamente en la cuenta del empleado."
    },
    {
      "id": "grammar",
      "title": "Gramática: Present Perfect vs Past Simple",
      "content": "Usamos el **Past Simple** para acciones terminadas en un momento específico del pasado:\n- *I opened the account last Tuesday.*\n- *Did you send the transfer yesterday?*\n\nUsamos el **Present Perfect** para acciones con relevancia en el presente o experiencias sin tiempo definido:\n- *The client has already signed the contract.* (Ya lo ha hecho, no importa cuándo exactamente).\n- *Have you ever worked in a central bank?* (¿Alguna vez en tu vida?).\n\n**Since vs For**:\n- **For** + periodo de tiempo (ej. *for 10 years*).\n- **Since** + punto específico en el tiempo (ej. *since 2015*)."
    },
    {
      "id": "vocabulary",
      "title": "Vocabulario Esencial y Expresiones",
      "content": "| Término | Significado |\n| :--- | :--- |\n| **Balance** | El saldo actual de la cuenta |\n| **Bank Statement** | Extracto bancario con todos los movimientos |\n| **To credit an account** | Ingresar o añadir dinero a una cuenta |\n| **To debit an account** | Retirar o cargar dinero a una cuenta |\n| **Withdrawal** | Retirada de efectivo |\n| **Deposit** | Ingreso de dinero |\n| **Wire transfer** | Transferencia bancaria |"
    }
  ]
}
