{
  "title": "Week 9: Strategic Long-term Planning",
  "content": "# Strategic Financial Planning\n\nLong-term planning (3-5+ years) requires a shift from operational detail to strategic vision. This week explores how to model long-term growth and capital allocation.\n\n## The Strategic Plan vs. The Budget\n- **The Budget**: 1-year focus, very granular, focuses on departments and cost control.\n- **The Strategic Plan**: 3-5+ year focus, high-level, focuses on market expansion, new products, and capital structure changes.\n\n## Capital Allocation\nHow should a company use its excess cash? Decisions include:\n1. **Reinvesting in the Business**: CAPEX, R&D.\n2. **M&A**: Buying other companies.\n3. **Dividends**: Returning cash to shareholders.\n4. **Share Buybacks**: Reducing the number of shares to increase EPS.\n\n## Scenario Planning\nModeling different 'versions' of the future:\n- **Base Case**: The most likely outcome.\n- **Upside (Best Case)**: Optimistic assumptions.\n- **Downside (Worst Case)**: Pessimistic assumptions (useful for stress-testing debt covenants).\n\n## Grammar: Precision in Future Tenses\nUse varied structures for future events:\n- *We are to launch the new product line by Q3.*\n- *The expansion is set to begin once funding is secured.*\n- *Should the market stabilize, we anticipate a recovery.*",
  "objectives": [
    "Differentiate between a budget and a strategic plan",
    "Identify capital allocation options for excess cash",
    "Model different scenarios (Base, Upside, Downside)"
  ],
  "keyTerms": [
    { "term": "Capital Allocation", "definition": "The process of deciding how to spend a company's financial resources to maximize shareholder value." },
    { "term": "Share Buyback", "definition": "The purchase by a company of its own outstanding shares that reduces the number of shares on the open market." },
    { "term": "Covenant", "definition": "A condition in a loan agreement that requires the borrower to fulfill certain conditions or forbids certain actions." }
  ]
}
