{
  "title": "Small Business Finance & Taxes",
  "sections": [
    {
      "id": "biz-finance",
      "title": "Financing a Small Business",
      "content": "Entrepreneurs need capital to start and grow their ventures.\n\n- **Seed Capital**: The initial funding used to start a business.\n- **Venture Capital**: Funding provided by investors to startups with high growth potential.\n- **Angel Investor**: A wealthy individual who provides capital for a business start-up, usually in exchange for convertible debt or ownership equity.\n- **Bootstrapping**: Starting a company with little capital and relying on personal savings and revenue from the business.\n- **Crowdfunding**: Raising small amounts of money from a large number of people, typically via the internet."
    },
    {
      "id": "tax-basics",
      "title": "Understanding Business Taxes",
      "content": "All businesses must comply with tax regulations:\n\n- **VAT (Value Added Tax)**: A consumption tax placed on a product whenever value is added at each stage of the supply chain.\n- **Corporation Tax**: A tax on the profits of a company.\n- **Income Tax**: Tax on personal earnings (for sole traders).\n- **Tax Return**: A form filed with a tax authority that reports income, expenses, and other pertinent tax information.\n- **Tax Deduction**: An expense that can be subtracted from a person's or business's gross income to reduce the amount of tax owed.\n- **Audit**: An official inspection of an individual's or organization's accounts."
    },
    {
      "id": "grammar-modals-certainty",
      "title": "Grammar Focus: Modals of Certainty & Probability",
      "content": "We use modals to talk about business predictions and likelihood.\n\n- The new tax law **may** affect our profits. (La nueva ley fiscal podría afectar a nuestros beneficios).\n- We **must** pay our taxes by the end of the quarter. (Debemos pagar nuestros impuestos al final del trimestre).\n- The audit **might** take longer than expected. (La auditoría podría tardar más de lo esperado).\n- That **can't** be the correct figure! (¡Esa no puede ser la cifra correcta!).\n\n**Modals**: Must (100%), Should (90%), May/Might/Could (50%), Can't (0%)."
    },
    {
      "id": "vocabulary_summary",
      "title": "Vocabulary Summary",
      "content": "| English | Spanish |\n| :--- | :--- |\n| **Turnover / Revenue** | Facturación / Ingresos brutos |\n| **Profit Margin** | Margen de beneficio |\n| **Overhead costs** | Gastos generales / fijos |\n| **Tax Evasion** | Evasión fiscal (ilegal) |\n| **Tax Avoidance** | Elusión fiscal (legal) |\n| **Sole Trader** | Autónomo |\n| **Invoice** | Factura |"
    }
  ],
  "objectives": [
    "Identify different sources of funding for startups and SMEs",
    "Understand basic tax terminology for business operations",
    "Use modal verbs to express degrees of certainty in financial forecasts"
  ],
  "keyTerms": [
    { "term": "Revenue", "definition": "The total amount of income generated by the sale of goods or services related to the company's primary operations." },
    { "term": "VAT", "definition": "Value Added Tax." }
  ]
}
