{
  "title": "Data Protection and GDPR: Safeguarding Information",
  "sections": [
    {
      "id": "gdpr-principles",
      "title": "GDPR Principles for Administrative Professionals",
      "content": "As an administrative professional at a B2 level, you are often the 'gatekeeper' of sensitive information. Understanding the **General Data Protection Regulation (GDPR)** is essential for maintaining compliance and avoiding heavy fines for your organisation.\n\n### Core Principles\n- **Lawfulness, Fairness, and Transparency**: Data must be processed legally and the subject must be informed.\n- **Purpose Limitation**: You should only collect data for specific, explicit, and legitimate purposes.\n- **Data Minimisation**: Only collect the data that is absolutely necessary (e.g., don't ask for a passport number if only a name is needed).\n- **Storage Limitation**: Data should not be kept for longer than is necessary for the purposes for which it is processed.\n- **Integrity and Confidentiality**: Ensuring protection against unauthorised or unlawful processing and against accidental loss.\n\n### Subject Access Requests (SARs)\nA **Subject Access Request** is when an individual asks for a copy of the personal data an organisation holds about them. Administrative staff are often responsible for collating this data within the legal timeframe (usually 30 days)."
    },
    {
      "id": "data-breach",
      "title": "Handling a Data Breach",
      "content": "A **data breach** occurs when personal data is lost, destroyed, corrupted, or disclosed without authority. \n\n**Action Protocol:**\n1. **Identify**: Confirm that a breach has occurred (e.g., an email sent to the wrong recipient).\n2. **Contain**: Take immediate steps to limit the damage (e.g., recall the email or lock the affected account).\n3. **Assess**: Determine the risk to the individuals affected.\n4. **Notify**: Under GDPR, serious breaches must be reported to the regulator within **72 hours**.\n\nIn professional communication, reporting a breach requires a factual, neutral tone without emotive language."
    },
    {
      "id": "grammar-complex-passives",
      "title": "Grammar: Complex Passives in Official Reporting",
      "content": "In formal administration and legal contexts, we use **complex passive structures** to report information or opinions without attributing them to a specific person. This creates a sense of objectivity and distance.\n\n### Common Structures\n1. **It + is + [thought/said/believed/reported] + that...**\n   - *\"**It is reported that** the data breach was caused by a phishing attempt.\"*\n   - *\"**It is estimated that** over 500 records were compromised.\"*\n\n2. **Subject + is + [thought/said/believed/reported] + to + [infinitive]**\n   - *\"The server **is believed to have been** vulnerable for several months.\"*\n   - *\"The new policy **is expected to improve** our compliance score.\"*\n\nThese structures are particularly useful when writing reports where the source of information is confidential or when discussing general consensus."
    },
    {
      "id": "phrase-bank",
      "title": "PhraseBank: GDPR & Privacy",
      "content": "1. **personally identifiable information (PII)** — Any data that can be used to identify a specific person.\n2. **data controller** — The person or organisation that determines the purpose of data processing.\n3. **data processor** — A third party that processes data on behalf of the controller.\n4. **to be in compliance with** — To follow the rules and regulations correctly.\n5. **to exercise a right** — To use a legal right (e.g., the right to be forgotten).\n6. **to redact information** — To black out or remove sensitive information from a document.\n7. **security breach** — An incident that results in unauthorised access to data.\n8. **encryption** — The process of converting information into a code to prevent unauthorised access.\n9. **opt-in / opt-out** — Choosing to participate or not participate in data collection.\n10. **third-party disclosure** — Sharing data with an external company.\n11. **non-disclosure agreement (NDA)** — A contract preventing the sharing of confidential info.\n12. **due diligence** — The care that a reasonable person exercises to avoid harm.\n13. **to mitigate risk** — To make a risk less severe.\n14. **sensitive data** — Data that requires higher protection (e.g., health or ethnic origin).\n15. **anonymisation** — Removing identifying markers so data is no longer PII."
    },
    {
      "id": "deliverable",
      "title": "Weekly Deliverable (Portfolio)",
      "content": "### Task: Data Privacy Internal Audit\nPerform a 'mini-audit' of your current (or a hypothetical) workspace and write a 250-word report.\n\n**Structure:**\n1. **Observation**: Identify two potential privacy risks (e.g., unlocked filing cabinets, passwords on sticky notes).\n2. **Evaluation**: Use **complex passives** to describe how these risks are perceived (e.g., 'It is thought that...').\n3. **Recommendations**: Suggest two actions to ensure the office is 'in compliance' with GDPR."
    },
    {
      "id": "dpia-protocol",
      "title": "Data Protection Impact Assessments (DPIAs)",
      "content": "A **DPIA** is a process designed to help you identify and minimise the data protection risks of a project. It is mandatory under GDPR for any processing that is likely to result in a high risk to individuals.\n\n### When is a DPIA required?\n- When using new technologies (e.g., AI in recruitment).\n- Large-scale processing of sensitive data (health, criminal records).\n- Systematic monitoring of a public area (CCTV).\n\n### Key Steps in a DPIA\n1. **Describe**: Define the nature, scope, and context of the processing.\n2. **Assess**: Evaluate the necessity and proportionality of the data collection.\n3. **Identify Risks**: Look for potential breaches or misuses of data.\n4. **Mitigate**: Implement measures to reduce those risks."
    },
    {
      "id": "cyber-hygiene",
      "title": "Cyber Hygiene for Administrative Professionals",
      "content": "Daily habits can prevent 80% of data breaches. Administrative staff are the first line of defence against cyber threats.\n\n### Essential Practices\n- **Password Integrity**: Use complex, unique passwords and Multi-Factor Authentication (MFA).\n- **Phishing Awareness**: Be wary of 'Urgent' emails asking for passwords or bank details. **It is estimated that** 90% of successful attacks start with phishing.\n- **Clear Desk Policy**: Ensure no PII is visible on desks or screens when you are away from your workstation.\n- **Secure Disposal**: Use cross-cut shredders for physical documents containing sensitive info."
    }
  ],
  "objectives": [
    "Summarise the core principles of GDPR in an administrative context",
    "Describe the steps to handle and report a data breach professionally",
    "Use complex passive structures to report information objectively",
    "Identify and mitigate common privacy risks in the office environment",
    "Determine when a Data Protection Impact Assessment (DPIA) is required",
    "Apply best practices for cyber hygiene to prevent data leaks"
  ],
  "keyTerms": [
    { "term": "PII", "definition": "Personally Identifiable Information: data that can be used on its own or with other information to identify, contact, or locate a single person." },
    { "term": "SAR", "definition": "Subject Access Request: a right for an individual to get a copy of the personal information that is held about them." },
    { "term": "Redaction", "definition": "The process of removing sensitive information from a document before it is published or shared." },
    { "term": "Compliance", "definition": "The state of following a set of rules, regulations, or laws." },
    { "term": "DPIA", "definition": "Data Protection Impact Assessment: a process to identify and mitigate risks in a new data project." },
    { "term": "Phishing", "definition": "A fraudulent attempt to obtain sensitive information by disguising as a trustworthy entity in an email." },
    { "term": "MFA", "definition": "Multi-Factor Authentication: a security system that requires more than one method of authentication." }
  ]
}