{
  "title": "Leadership and Team Support in Administration",
  "sections": [
    {
      "id": "leadership-support",
      "title": "Leadership in the Support Function",
      "content": "Even in an administrative role, leadership is critical. At a B2 level, you are expected to take initiative, manage up (supporting your seniors), and coordinate with your peers to ensure the smooth running of the department.\n\n### Key Leadership Traits for Admin\n- **Anticipating Needs**: Identifying what a manager needs before they ask for it (e.g., preparing a briefing pack before a meeting).\n- **Delegation**: Knowing when and how to assign tasks to more junior staff or specialised departments.\n- **Accountability**: Taking ownership of processes and being responsible for the outcome, whether positive or negative.\n- **Mentorship**: Helping new or junior staff members understand office protocols and culture."
    },
    {
      "id": "managing-up",
      "title": "Managing Up: Supporting Senior Management",
      "content": "'Managing up' is the process of consciously working with your boss to obtain the best possible results for you, your boss, and the company. It is not about manipulation; it is about **alignment**.\n\n**Effective strategies:**\n- **Clarify Expectations**: Always confirm the 'what', 'why', and 'when' of a task.\n- **Provide Solutions, Not Problems**: When flagging an issue, always propose at least one potential solution.\n- **Adapt to Their Style**: Understand if your manager prefers a quick verbal update, a detailed email, or a dashboard view."
    },
    {
      "id": "grammar-causatives",
      "title": "Grammar: Causative Forms in Administration",
      "content": "In administrative roles, we often arrange for things to be done by others rather than doing them ourselves. We use **causative forms** to describe this.\n\n### 1. Have something done (Form: Have + Object + Past Participle)\nUsed when someone else performs a service for us.\n- *\"I need to **have the contracts signed** by Friday.\"*\n- *\"We **had the office refurbished** over the weekend.\"*\n\n### 2. Get someone to do something (Form: Get + Person + to + Infinitive)\nUsed when we persuade or assign someone to do a task.\n- *\"Can you **get IT to fix** the printer?\"*\n- *\"I **got the team to submit** their reports early.\"*\n\n### 3. Have someone do something (Form: Have + Person + Infinitive - no 'to')\nCommon in professional contexts for giving instructions.\n- *\"I'll **have my assistant call** you tomorrow.\"*\n- *\"The manager **had us review** the safety protocols.\"*"
    },
    {
      "id": "phrase-bank",
      "title": "PhraseBank: Leadership & Delegation",
      "content": "1. **to take the lead** — To take the main responsibility for a task.\n2. **to manage up** — To work effectively with your seniors to achieve goals.\n3. **to delegate a task** — To give a task to someone else to do.\n4. **to take initiative** — To act without being told what to do.\n5. **to be accountable for** — To be responsible for something and prepared to justify it.\n6. **to follow through** — To complete a task that has been started.\n7. **to provide a briefing** — To give someone the necessary info for a task.\n8. **to oversee a project** — To supervise or be in charge of a project.\n9. **to set an example** — To behave in a way that others should copy.\n10. **to empower someone** — To give someone the authority or power to do something.\n11. **to streamline communications** — To make communication clearer and faster.\n12. **to meet a deadline** — To finish a task by the agreed time.\n13. **to manage expectations** — To ensure people have realistic ideas about what can be achieved.\n14. **to touch base** — To briefly talk to someone to update them on a situation.\n15. **to loop someone in** — To include someone in a discussion or email thread."
    },
    {
      "id": "deliverable",
      "title": "Weekly Deliverable (Portfolio)",
      "content": "### Task: Leadership Reflection and Delegation Plan\nWrite a 300-word reflection on a time you took initiative in a professional or academic setting.\n\n**Structure:**\n1. **The Situation**: What was the problem or opportunity?\n2. **The Action**: What initiative did you take? Use **causative forms** (e.g., 'I had the files organised...', 'I got the team to...').\n3. **The Result**: What was the outcome and how did it show leadership?\n4. **Delegation Plan**: List three tasks you would delegate if you were promoted to Senior Ops Coordinator, and specify who you would **get to do** them."
    }
  ],
  "objectives": [
    "Identify and apply leadership traits within a support function",
    "Develop strategies for 'managing up' and aligning with senior management",
    "Master causative forms (have/get) to describe delegation and service management",
    "Communicate professional initiative and ownership in writing"
  ],
  "keyTerms": [
    { "term": "Accountability", "definition": "The obligation of an individual or organization to account for its activities and accept responsibility for them." },
    { "term": "Delegation", "definition": "The assignment of any authority to another person (normally from a manager to a subordinate) to carry out specific activities." },
    { "term": "Managing Up", "definition": "The process of consciously working with your superior to obtain the best possible results." },
    { "term": "Initiative", "definition": "The ability to assess and initiate things independently." }
  ]
}