{
  "title": "Financial Crimes & Compliance",
  "sections": [
    {
      "id": "compliance-intro",
      "title": "Introduction to Compliance",
      "content": "Compliance in banking means following the rules, laws, and regulations set by governments and financial authorities. It is essential for maintaining the integrity of the financial system.\n\n- **Regulatory Authorities**: Organizations that oversee banks (e.g., the SEC in the US, the FCA in the UK).\n- **Risk Management**: Identifying and mitigating potential legal and financial threats.\n- **Ethical Banking**: Ensuring that the bank's activities are honest and responsible."
    },
    {
      "id": "financial-crimes",
      "title": "Types of Financial Crimes",
      "content": "Banks must be vigilant against various criminal activities.\n\n- **Money Laundering (AML)**: The process of making 'dirty' money look 'clean' by passing it through legitimate bank accounts.\n- **Terrorist Financing**: Providing funds for terrorist activities.\n- **Fraud**: Deception intended to result in financial or personal gain (e.g., identity theft, phishing).\n- **Insider Trading**: Trading stock based on non-public, confidential information.\n- **Sanctions**: Restrictions imposed by governments against certain countries, organizations, or individuals."
    },
    {
      "id": "kyc-aml",
      "title": "KYC & AML Procedures",
      "content": "To prevent crimes, banks use specific procedures.\n\n- **KYC (Know Your Customer)**: Verifying the identity of clients before they open an account.\n- **CDD (Customer Due Diligence)**: Investigating a customer's background and source of wealth.\n- **SAR (Suspicious Activity Report)**: A report filed by a bank if they suspect money laundering or fraud."
    },
    {
      "id": "grammar-modals-deduction",
      "title": "Language Focus: Modals of Deduction & Passives",
      "content": "When investigating crimes, we use modals to express how certain we are about a past or present event.\n\n- **Must / Can't (High Certainty)**: \n  - 'The suspect **must have known** about the law.'\n  - 'That transaction **can't be** legitimate; it's too large.'\n- **Might / Could (Low Certainty)**: \n  - 'The error **could have been** an accident.'\n- **Passive Voice (Formal Reporting)**: \n  - 'The accounts **were frozen** immediately.'\n  - 'New regulations **are being implemented** this month.'"
    }
  ],
  "objectives": [
    "Define compliance and the role of regulatory authorities",
    "Identify common financial crimes like money laundering and fraud",
    "Understand KYC and CDD procedures used by banks",
    "Use modals of deduction and the passive voice in a professional context"
  ],
  "keyTerms": [
    { "term": "Money Laundering", "definition": "The concealment of the origins of illegally obtained money." },
    { "term": "Phishing", "definition": "The fraudulent practice of sending emails appearing to be from reputable companies to induce individuals to reveal personal information." },
    { "term": "Due Diligence", "definition": "Reasonable steps taken by a person or organization to avoid committing a tort or offence." }
  ]
}