{
  "title": "Ethical Finance and ESG",
  "sections": [
    {
      "id": "esg-pillars",
      "title": "Environmental, Social, and Governance (ESG)",
      "content": "Modern finance increasingly integrates non-financial factors into the investment process to manage risk and identify growth opportunities.\n\n- **Environmental**: Climate change, carbon emissions, waste management, and resource depletion.\n- **Social**: Labor standards, diversity, human rights, and community engagement.\n- **Governance**: Board composition, executive compensation, audit practices, and shareholder rights.\n- **Sustainable Investing**: An investment discipline that considers ESG criteria to generate long-term competitive financial returns and positive societal impact."
    },
    {
      "id": "impact-ethical",
      "title": "Impact Investing & Green Finance",
      "content": "The shift toward ethics has created new financial products and standards.\n\n- **Green Bonds**: Fixed-income instruments specifically earmarked to raise money for climate and environmental projects.\n- **Impact Investing**: Investments made with the intention to generate positive, measurable social and environmental impact alongside a financial return.\n- **Greenwashing**: The process of conveying a false impression or providing misleading information about how a company's products are more environmentally sound.\n- **Fiduciary Duty**: The legal obligation of one party to act in the best interest of another (e.g., a fund manager for their investors)."
    },
    {
      "id": "grammar-modals-obligation-nuance",
      "title": "Language Focus: Nuanced Modals & Hedging (Vague Language)",
      "content": "When discussing ethical dilemmas or uncertain futures, professionals use 'hedging' language to avoid sounding too definitive.\n\n- **Nuanced Modals**: \n  - 'This policy **could potentially** mitigate long-term governance risks.'\n  - 'The firm **might arguably** be the leader in sustainable practices.'\n- **Vague Language / Softeners**: \n  - '**It appears that** the company's carbon footprint is shrinking.'\n  - '**There is a general consensus that** ESG metrics require standardization.'"
    }
  ],
  "objectives": [
    "Analyze the three pillars of ESG and their relevance to modern valuation",
    "Identify ethical challenges such as greenwashing and fiduciary conflicts",
    "Use nuanced modals and 'hedging' language to discuss complex ethical and social issues"
  ],
  "keyTerms": [
    { "term": "Sustainability", "definition": "Meeting the needs of the present without compromising the ability of future generations to meet their own needs." },
    { "term": "Net Zero", "definition": "Achieving a balance between the greenhouse gases put into the atmosphere and those taken out." }
  ]
}