{
  "title": "Corporate Sustainability & Ethics",
  "sections": [
    {
      "id": "vocab",
      "title": "CSR & Ethical Administration",
      "content": "Modern administration requires a focus on Corporate Social Responsibility (CSR) and ethical decision-making to ensure long-term viability and positive brand reputation.\n\n- **Triple Bottom Line**: An accounting framework with three parts: social, environmental (or ecological), and financial (Profit, People, Planet).\n- **Carbon Footprint**: The total amount of greenhouse gases produced to directly and indirectly support organisational activities.\n- **Ethical Sourcing**: Ensuring that the products/services being sourced are created in safe facilities by workers who are treated fairly.\n- **Greenwashing**: Disinformation disseminated by an organisation so as to present an environmentally responsible public image.\n- **Sustainability Report**: A report published by a company or organisation about the economic, environmental, and social impacts caused by its everyday activities.\n- **Whistleblowing**: The disclosure by a person, usually an employee, in an organisation of management misconduct or illegal activities."
    },
    {
      "id": "grammar",
      "title": "Advanced Modals of Deduction (Past)",
      "content": "Modal verbs + 'have' + past participle are used to express varying degrees of certainty about past events in a professional context.\n\n- **Must have + past participle**: Used when we are almost certain that something happened.\n  *Example:* \"The auditor **must have found** an error; the board has called an emergency meeting.\"\n- **Could / Might have + past participle**: Used to express possibility or a past opportunity that wasn't taken.\n  *Example:* \"We **could have reduced** our waste last year if we had implemented the new recycling protocol.\"\n- **Can't have + past participle**: Used when we are almost certain that something did NOT happen.\n  *Example:* \"The manager **can't have approved** this expense; it exceeds his limit.\"\n- **Should have + past participle**: Used to express regret or criticism about a past action.\n  *Example:* \"We **should have audited** the supplier's ethical standards before signing the contract.\""
    }
  ],
  "objectives": [
    "Define and apply the 'Triple Bottom Line' concept in administrative decisions",
    "Identify 'greenwashing' and its risks to corporate reputation",
    "Use modal verbs to speculate on past administrative errors or missed opportunities",
    "Discuss the importance of whistleblowing policies in corporate governance"
  ],
  "keyTerms": [
    { "term": "Circular Economy", "definition": "An economic system aimed at eliminating waste and the continual use of resources." },
    { "term": "Net Zero", "definition": "A state in which the greenhouse gases going into the atmosphere are balanced by removal out of the atmosphere." }
  ]
}