{
  "acknowledge.mp3": "acknowledge",
  "aesthetic.mp3": "aesthetic",
  "although.mp3": "although",
  "analysis.mp3": "analysis",
  "apologize.mp3": "apologize",
  "b2-m1-l3-pronun-1a.mp3": "What I NEED is more TIME.",
  "b2-m1-l3-pronun-1b.mp3": "It was MARIA who made the DECISION.",
  "b2-m1-l3-pronun-1c.mp3": "What SURPRISED me most was their HONESTY.",
  "b2-m1-l4-pronun-1a.mp3": "She had WORKED for YEARS before she was PROMOTED.",
  "b2-m1-l4-pronun-1b.mp3": "They had LIVED in PARIS before they MOVED to ROME.",
  "b2-m1-l4-pronun-1c.mp3": "I had WANTED to VISIT for YEARS.",
  "b2-m1-l6-listening-exam.mp3": "[EXAM CONDITIONS: Students hear this TWICE]\n\nInterviewer: Today I'm speaking with Dr. Marcus Williams, a researcher specializing in workplace productivity. Dr. Williams, what's the biggest mistake people make about productivity?\n\nDr. Williams: Well, what most people don't realize is that productivity isn't about working more hours—it's about working smarter. I've been studying high performers for over a decade now, and what consistently sets them apart is not that they work harder, but that they work with more intention and focus.\n\nInterviewer: Can you give us an example?\n\nDr. Williams: Certainly. It was during a study we conducted in 2018 that we discovered something surprising. We found that the most productive employees weren't those who stayed latest at the office. In fact, many of them left right on time. What they had been doing differently was protecting their peak energy hours. They knew when they were mentally sharpest—usually the first two to three hours after arriving—and they guarded that time fiercely for their most important work.\n\nInterviewer: So timing matters more than duration?\n\nDr. Williams: Exactly. What research shows is that the human brain isn't designed for eight hours of continuous focused work. We operate in cycles—typically 90 to 120 minutes of high focus followed by a need for rest. The problem is that modern work culture ignores these natural rhythms. People push through fatigue, thinking they're being productive, when actually their work quality is declining.\n\nInterviewer: What do you recommend?\n\nDr. Williams: What I tell people is to align their most challenging tasks with their peak energy periods. If you're sharpest in the morning, don't waste that time checking emails or attending routine meetings. Use it for deep, creative, or analytical work. Save the administrative tasks for your lower-energy periods in the afternoon.\n\nIt was implementing this approach that transformed my own productivity. I now block my mornings for research and writing—the work that requires my full cognitive capacity. Meetings and emails get scheduled for the afternoon when I have less mental energy anyway.\n\nInterviewer: What about the modern obsession with multitasking?\n\nDr. Williams: That's perhaps the biggest productivity myth of all. What neuroscience has demonstrated is that the human brain cannot actually multitask in the way we think it can. What we call multitasking is really rapid task-switching, and every switch comes with a cognitive cost. Studies show it can take 23 minutes to fully regain deep focus after an interruption.\n\nWhat successful people do instead is practice what I call \"single-tasking\"—giving full attention to one thing at a time. It might feel slower initially, but the quality of work is dramatically higher, and you actually complete tasks faster because you're not constantly reorienting yourself.",
  "b2-m2-l4-debate-coach.mp3": "Interviewer: Today we're speaking with Sarah Mitchell, a professional debate coach. Sarah, what's the most important skill in debating?\n\nSarah: Well, I'd say it's the ability to structure your arguments logically. You need to present your points clearly. Furthermore, you must support each claim with evidence. However, it's not just about what you say—it's also about how you respond to opposing viewpoints.\n\nInterviewer: How should someone respond to a counter-argument?\n\nSarah: First, acknowledge the other person's point. You might say \"That's a valid concern\" or \"I understand that perspective.\" Nevertheless, you then need to explain why your position is stronger. For instance, you could point out flaws in their reasoning or provide contradictory evidence.\n\nInterviewer: What about using linking words?\n\nSarah: They're absolutely crucial. Linking words like \"furthermore,\" \"on the other hand,\" and \"consequently\" help your audience follow your train of thought. Moreover, they make you sound more credible and persuasive. Without them, your argument can seem disjointed.\n\nInterviewer: Any final advice?\n\nSarah: Practice! Watch experienced debaters and note how they structure arguments. Additionally, read well-written opinion pieces to see how professionals use linking words. Most importantly, don't be afraid to engage in respectful discussions—that's how you improve.",
  "b2-m2-l5-education-debate.mp3": "Moderator: Welcome to today's panel on education reform. Dr. Stevens, let's start with you. What's your position?\n\nDr. Stevens: Thank you. It is my contention that traditional education models are outdated. There is compelling evidence to suggest that personalized learning yields better outcomes. Studies have shown that students learn more effectively when instruction is tailored to their individual needs. Furthermore, technology now makes this approach feasible on a large scale.\n\nModerator: Professor Martinez, you have concerns about this approach?\n\nProf. Martinez: Indeed. While I acknowledge the potential benefits, one could argue that we're moving too quickly. If we implement these changes without proper teacher training, the results could be disastrous. Moreover, there's the question of equity—not all students have equal access to technology. Critics rightly point out that this could exacerbate existing inequalities.\n\nDr. Stevens: Those are valid concerns. However, I would contend that maintaining the status quo is more dangerous. Research indicates that current methods are failing many students. If society were to invest in both technology and teacher training, we could address Professor Martinez's concerns while still making necessary progress.\n\nProf. Martinez: I don't dispute the need for change. What I'm advocating for is a more measured approach. There is evidence to suggest that hybrid models—combining traditional and innovative methods—might be more effective than wholesale replacement.\n\nModerator: Interesting points from both sides. Thank you.",
  "b2-m2-l6-healthcare-debate.mp3": "Moderator: Today we're discussing universal healthcare. Dr. Chen, your opening statement?\n\nDr. Chen: Thank you. It is widely argued that healthcare is a fundamental human right. There is compelling evidence to suggest that universal healthcare systems achieve better health outcomes at lower costs than market-based systems. Furthermore, preventative care becomes more accessible when financial barriers are removed. Consequently, populations in countries with universal healthcare tend to be healthier overall.\n\nModerator: Mr. Thompson, your response?\n\nMr. Thompson: While I acknowledge Dr. Chen's points, one could argue that market-based systems drive innovation more effectively. Critics contend that government-run healthcare leads to longer waiting times and reduced quality of care. Moreover, the tax burden required to fund universal healthcare might have been underestimated. If we had implemented such a system, our economy could have suffered significantly.\n\nDr. Chen: Those concerns have largely been debunked by international comparisons. Nevertheless, I concede that transitioning to universal healthcare requires careful planning. However, the evidence overwhelmingly suggests that the benefits outweigh the challenges.\n\nModerator: Thank you both for a balanced discussion.",
  "b2-m3-l4-listening-1.mp3": "Podcast: Business English in Practice\n\nHost: Welcome back to Business English in Practice. Today we're discussing common mistakes non-native speakers make with collocations and idioms. Joining me is language expert Dr. Patricia Lee. Patricia, what's the most common mistake you see?\n\nDr. Lee: Thanks for having me. The most common mistake is directly translating from your native language. For example, many Spanish speakers say \"make a photo\" instead of \"take a photo.\" Or they might say \"tell a presentation\" instead of \"give a presentation.\" These are understandable errors, but they can make your English sound unnatural.\n\nHost: Can you elaborate on why collocations matter so much?\n\nDr. Lee: Absolutely. Native speakers don't think about collocations—they just know them instinctively. When you use the wrong collocation, it doesn't necessarily prevent understanding, but it does mark you as a non-native speaker. If you want to take your English to the next level, mastering collocations is essential.\n\nHost: What about idioms? Should learners focus on them?\n\nDr. Lee: Here's my advice: learn idioms, but use them carefully. Some idioms are very common in business—like \"get the ball rolling\" or \"on the same page\"—and using these naturally can really make you sound more fluent. However, don't try to force too many idioms into your speech. It's better to use a few correctly than to overuse them and sound awkward.\n\nHost: Can you give us an example of a commonly misused idiom?\n\nDr. Lee: Sure. \"Break the ice\" is often misused. Some learners use it to mean \"start a project,\" but it specifically means to make people feel more comfortable in a social situation, especially when they first meet. You might break the ice at a party by introducing yourself, but you wouldn't break the ice on a construction project—you'd get the ball rolling instead.\n\nHost: That's a great distinction. What resources do you recommend for learning collocations?\n\nDr. Lee: Read extensively in English, especially authentic materials like news articles, business reports, or professional blogs. When you encounter a new collocation, write it down with an example sentence. Don't just learn individual words—learn them in context with their natural partners. There are also excellent collocation dictionaries online that can help.\n\nHost: Finally, what's your top tip for improving fluency with collocations and idioms?\n\nDr. Lee: Practice, practice, practice! Use them in your writing and speaking. Don't be afraid to make mistakes—that's how we learn. And pay attention to feedback. If a native speaker uses a different phrase than you would, ask yourself why. Understanding these patterns will help you internalize collocations more quickly.\n\nHost: Wonderful advice. Thanks so much, Patricia.\n\nDr. Lee: My pleasure!",
  "b2-m3-l5-listening-1.mp3": "Business Negotiation Meeting\n\nJames (Project Manager): Thank you all for joining today's meeting. As you know, we need to finalize the budget for the new marketing campaign. Let's start with the main points of contention. Emma, would you like to present the creative team's position?\n\nEmma (Creative Director): Certainly. We believe the campaign needs a budget of $500,000 to be effective. This includes video production, social media advertising, and influencer partnerships. If I understand correctly, finance is proposing we reduce this to $350,000. However, I'm afraid that with such a reduction, we simply cannot deliver the quality and reach we need.\n\nMichael (Finance Director): I appreciate your concern, Emma, and I recognize the creative team's expertise. However, we need to be realistic about our financial constraints. Let me explain our position. We have other priorities this quarter, including technology upgrades and expanding our sales team. Would it be possible to achieve your goals with a phased approach? Perhaps we start with $350,000 for the initial phase and evaluate results before committing additional funds?\n\nEmma: I see your point, Michael, but the issue is that marketing campaigns need momentum. A phased approach might actually cost us more in the long run because we'd lose the compounding effect of a concentrated effort.\n\nJames: These are both valid concerns. Could we explore a middle ground? Emma, what if we prioritize the channels that give us the best return on investment? Which elements of your plan are absolutely essential, and which could we potentially postpone?\n\nEmma: That's a fair point. Well, video production is critical—that's where we build brand awareness. We could potentially reduce the influencer budget by selecting fewer, more targeted partnerships. That might save us... maybe $75,000?\n\nMichael: I'd like to propose something. What if we approved $400,000? That's a $50,000 increase from our initial position. In return, would you be willing to provide weekly performance reports so we can track ROI closely?\n\nEmma: That's closer to what we need. However, weekly reports might be excessive and would take time away from execution. Could we compromise on bi-weekly reports for the first month, then monthly thereafter once we've established that the campaign is performing?\n\nMichael: I appreciate your willingness to be flexible. Bi-weekly initially makes sense. But I'd like to add one condition: if after the first month the metrics aren't meeting targets, we need to review whether to continue at that budget level.\n\nEmma: I can agree to that, provided we define those targets clearly upfront so there's no ambiguity.\n\nJames: This sounds like we're making progress. So, to summarize: $400,000 budget, bi-weekly reports for the first month then monthly, and clearly defined performance targets with a review point at one month. Does that work for everyone?\n\nEmma: Yes, I can work with that.\n\nMichael: Agreed. Let's document these terms and move forward.\n\nJames: Excellent. Thank you both for being so collaborative. This is a good example of finding solutions that address everyone's needs.",
  "b2-m3-l6-listening-final.mp3": "Final Mock Listening Exam - Full Interview\n\n[This would be a complete 5-minute interview covering multiple topics from the course, testing all listening skills comprehensively]\n\nInterviewer: Welcome to \"Future of Education.\" Today I'm speaking with Dr. Rachel Martinez, who's been researching innovative teaching methods. Dr. Martinez, what changes are you seeing in education?\n\nDr. Martinez: Thank you for having me. The most significant shift we're witnessing is personalized learning. Traditional education operated on a one-size-fits-all model, but we now understand that students learn at different paces and through different modalities. Technology is enabling us to customize educational experiences in ways that were impossible before.\n\n[Interview continues with comprehensive content covering education, technology, challenges, solutions, and future predictions...]",
  "cant-have.mp3": "cant have",
  "characteristic.mp3": "characteristic",
  "collaborate.mp3": "collaborate",
  "compelling.mp3": "compelling",
  "compromise.mp3": "compromise",
  "conducted.mp3": "conducted",
  "contemporary.mp3": "contemporary",
  "could-have.mp3": "could have",
  "demonstrated.mp3": "demonstrated",
  "diplomatic.mp3": "diplomatic",
  "emphasize.mp3": "emphasize",
  "established.mp3": "established",
  "flexibility.mp3": "flexibility",
  "implemented.mp3": "implemented",
  "metaphor.mp3": "metaphor",
  "might-have.mp3": "might have",
  "must-have.mp3": "must have",
  "necessary.mp3": "necessary",
  "negotiation.mp3": "negotiation",
  "nuanced.mp3": "nuanced",
  "particularly.mp3": "particularly",
  "pronunciation.mp3": "pronunciation",
  "pronunciation/acknowledge.mp3": "acknowledge",
  "pronunciation/ascertain.mp3": "ascertain",
  "pronunciation/come-across.mp3": "come across",
  "pronunciation/consequently.mp3": "consequently",
  "pronunciation/demonstrate.mp3": "demonstrate",
  "pronunciation/endeavor.mp3": "endeavor",
  "pronunciation/facilitate.mp3": "facilitate",
  "pronunciation/figure-out.mp3": "figure out",
  "pronunciation/implementation.mp3": "implementation",
  "pronunciation/look-after.mp3": "look after",
  "pronunciation/nevertheless.mp3": "nevertheless",
  "pronunciation/put-up-with.mp3": "put up with",
  "pronunciation/requisite.mp3": "requisite",
  "pronunciation/set-up.mp3": "set up",
  "pronunciation/subsequently.mp3": "subsequently",
  "pronunciation/turn-down.mp3": "turn down",
  "proposal.mp3": "proposal",
  "protagonist.mp3": "protagonist",
  "recommend.mp3": "recommend",
  "suggest.mp3": "suggest",
  "thorough.mp3": "thorough",
  "undertaken.mp3": "undertaken",
  "would-have.mp3": "would have",
  "adm-b2-w1-metrics-report.mp3": "Good morning everyone. I’d like to give you a quick update on our operational metrics for the last quarter. Our throughput has been quite impressive, reaching 750 units, which is a significant increase compared to the previous period. Regarding our Service Level Agreements, I am pleased to confirm that we are currently meeting all our SLAs for response times. However, our lead time for onboarding new vendors still needs some improvement to align with our long-term KPIs. We are working on a plan to streamline the documentation process to address this. Thanks.",
  "adm-b2-w2-handover-dialogue.mp3": "Sam: Hi Alex, thanks for meeting me. Ready for the handover?\nAlex: Yes. Quick recap: the Week 41 invoice approvals are all done. I’m currently in progress with the vendor database update.\nSam: Any blockers?\nAlex: Yes, the Dublin shipping logistics are blocked because we’re waiting for the local manager’s approval. \nSam: And any risks I should know about?\nAlex: The monthly report might slip if we don’t get the data by Friday EOD. The key point is to follow up with Dublin on Tuesday. \nSam: Got it. Next steps are Tuesday follow-up and Wednesday vendor list finalisation. Thanks!",
  "adm-b2-w2-incident-report.mp3": "Attention everyone. We are currently experiencing a service outage affecting the CRM in the North Region. Users are unable to log in, which is impacting our sales operations. Our ETR is 11:00 am. We have identified the root cause as a server overload during a backup window. We are currently taking mitigation steps to restore access. I will provide the next update at 10:45 am. Thank you for your patience.",
  "adm-b2-w3-compliance-meeting.mp3": "DPO: Good afternoon. As we are launching the new AI recruitment tool, it is mandatory that we conduct a Data Protection Impact Assessment. \nAdmin: Understood. It is expected that the assessment will take about two weeks. \nDPO: Correct. We must ensure full transparency in how the AI screens CVs. Also, we need to enforce a strict clear-desk policy to maintain compliance. \nAdmin: I’ve already sent a memo to the team about cyber hygiene and the importance of using Multi-Factor Authentication. \nDPO: Excellent. Integrity and Confidentiality are our top priorities.",
  "adm-b2-w3-breach-report.mp3": "It is reported that a data breach occurred late Friday afternoon. An unencrypted USB drive is believed to have been lost in the main reception area. It is estimated that approximately 200 employee records may have been compromised. Containment measures were initiated immediately following the discovery. The regulator is expected to be notified within the 72-hour window. Further updates will be provided as the investigation progresses.",
  "kpi.mp3": "KPI",
  "sla.mp3": "SLA",
  "streamline.mp3": "streamline",
  "throughput.mp3": "throughput",
  "kaizen.mp3": "Kaizen",
  "redundant.mp3": "redundant",
  "overhaul.mp3": "overhaul",
  "handover.mp3": "handover",
  "dependency.mp3": "dependency",
  "outage.mp3": "outage",
  "mitigation.mp3": "mitigation",
  "compliance.mp3": "compliance",
  "redaction.mp3": "redaction",
  "anonymisation.mp3": "anonymisation",
  "phishing.mp3": "phishing",
  "mfa.mp3": "MFA",
  "adm-b2-w4-meeting-minutes.mp3": "Chair: Okay, let's move to the next item on the agenda: the office relocation. Sarah, could you take the minutes for this section?\nSarah: Certainly. I'll make sure to record all decisions and action items.\nChair: Thanks. I strongly recommend that we consider the North Dock area. It's well-connected.\nJohn: I agree to that, but I'd like to point out that the rent there is 20% higher than our current budget.\nSarah: Sorry, could I just clarify? John, are you suggesting we look for cheaper alternatives or just noting the cost?\nJohn: I'm suggesting we negotiate a longer lease to reduce the monthly rate.\nSarah: Got it. I've recorded that you suggested negotiating a longer lease. \nChair: Excellent. Action: Finance to provide a cost-benefit analysis by next Tuesday.",
  "adm-b2-w4-executive-summary.mp3": "This executive summary outlines the proposal for the 'Digital First' initiative. The report concludes that transitioning to a paperless office will reduce operational costs by 15% within the first year. It is recommended that we implement the new document management system across all departments by Q3. Data indicates that early adopters have already seen a significant increase in retrieval efficiency. The ROI is expected to be reached within 18 months. Bullet points in the full report highlight the specific technical requirements and training schedule.",
  "quorum.mp3": "quorum",
  "agenda.mp3": "agenda",
  "minutes.mp3": "minutes",
  "apologies.mp3": "apologies",
  "verbatim.mp3": "verbatim",
  "adjourn.mp3": "adjourn",
  "convene.mp3": "convene",
  "adm-b2-w5-conflict-resolution.mp3": "Manager: I can't believe the boardroom wasn't booked! This is a total disaster!\nAdmin: I understand how frustrating this is, especially with the clients waiting. I apologize for the oversight. It seems there was a glitch in the new booking system. What I can do is move the meeting to the executive suite immediately—it's free and already has refreshments. Would that work for you?\nManager: Well, it's not ideal, but at least we have a room. Fine.\nAdmin: Great. I'll have the reception team guide the clients there now, and I'll personally ensure the system is audited this afternoon to avoid this happening again.\nManager: Thanks. I appreciate you finding a quick solution.",
  "adm-b2-w5-feedback-sbi.mp3": "Hi Mark, I'd like to give you some quick feedback. During the project briefing this morning (Situation), you interrupted the lead architect three times while she was explaining the technical constraints (Behavior). This meant that some of the junior engineers missed key safety details and we had to extend the meeting by 20 minutes to clarify (Impact). In the future, could you wait until the end of each section to ask your questions? This would really help the meeting flow more effectively.",
  "accountability.mp3": "accountability",
  "delegation.mp3": "delegation",
  "initiative.mp3": "initiative",
  "de-escalation.mp3": "de-escalation",
  "empathy.mp3": "empathy",
  "compromise.mp3": "compromise",
  "adm-b2-w6-itinerary-briefing.mp3": "Hi Sarah, I've finalized your Singapore itinerary. Not only is the flight scheduled with a comfortable layover in Dubai, but I've also arranged for the private car to meet you directly at the gate. Only after the second board meeting on Tuesday will you have some free time. Under no circumstances should you forget your SG Arrival Card, as they are very strict at immigration. Rarely have I seen such a packed schedule, so I've included 15-minute buffer blocks between every meeting to help you manage the heat and the jet lag.",
  "adm-b2-w6-gatekeeping.mp3": "Vendor: Hi, I'd like to speak with Mr. Henderson about our new software solution.\nAdmin: I'm afraid Mr. Henderson is unavailable at the moment. He is currently in a 'Deep Work' time block and cannot be disturbed.\nVendor: It will only take five minutes.\nAdmin: Under no circumstances does he take unscheduled calls during this time. However, I can certainly flag your proposal for his weekly priority review. Alternatively, you could coordinate with our IT lead, Jane Smith, who oversees our software logistics. Would you like her contact details?",
  "esta.mp3": "ESTA",
  "itinerary.mp3": "itinerary",
  "reconciliation.mp3": "reconciliation",
  "gatekeeping.mp3": "gatekeeping",
  "per-diem.mp3": "per diem",
  "inversion.mp3": "inversion",
  "shortlist.mp3": "shortlist",
  "appraisal.mp3": "appraisal",
  "probation.mp3": "probation",
  "retention.mp3": "retention",
  "kpi.mp3": "KPI",
  "vacancy.mp3": "vacancy",
  "turnover.mp3": "turnover",
  "remuneration.mp3": "remuneration",
  "induction.mp3": "induction",
  "compliance.mp3": "compliance",
  "adm-b2-w7-interview-debrief.mp3": "Manager: So, how did the interview with the Project Manager candidate go?\nAdmin: It was quite productive. The candidate asserted that they had extensive experience with international logistics. When I inquired whether they were comfortable with frequent travel, they stated that they were fully available. They also emphasized that their previous team had achieved all their KPIs for three consecutive years. I recommended that we move them to the final shortlist, as their remuneration expectations align with our budget.",
  "adm-b2-w7-onboarding-briefing.mp3": "Admin: Welcome to the team! Today is your first day of induction. I've already signed off on your asset provisioning, so your laptop and access cards are ready at your desk. We'll start with the compliance training this morning. Please remember that your three-month probationary period begins today, and we'll have monthly check-ins to see how you are aligning with our department goals. Do you have any questions before we look at your Professional Development Plan?"
}