[
  {
    "es": "Cuál es el país más frío en el que has estado nunca?",
    "en": "What’s the coldest country you’ve ever been to"
  },
  {
    "es": "Cuál es la comida más buena que has probado nunca?",
    "en": "What’s the most delicious food you’ve ever tasted"
  },
  {
    "es": "Cuál es el edificio más alto que has visitado nunca?",
    "en": "What’s the highest building you’ve ever visited"
  },
  {
    "es": "Cuál es la playa más larga en la que has estado nunca?",
    "en": "What’s the longest beach you’ve ever been to"
  },
  {
    "es": "Cuál es la persona más tímida que has conocido nunca?",
    "en": "Who’s the shyest person you’ve ever met"
  },
  {
    "es": "Cuál es la canción más triste que has escuchado nunca?",
    "en": "What’s the saddest song you’ve ever listened to"
  },
  {
    "es": "Cuál es el chiste más gracioso que te han contado nunca?",
    "en": "What’s the funniest joke you’ve ever been told"
  },
  {
    "es": "Cuál es el día más feliz que has tenido nunca?",
    "en": "What’s the happiest day you’ve ever had"
  },
  {
    "es": "Cuál es el sitio más caluroso en el que has estado nunca?",
    "en": "What’s the hottest place you’ve ever been to"
  },
  {
    "es": "Cuál es el idioma más difícil que has estudiado nunca?",
    "en": "What’s the most difficult language you’ve ever studied"
  },
  {
    "es": "Cuánto cuesta?",
    "en": "cuidado con esta pregunta porque a menudo los alumnos dicen: «how much cost"
  },
  {
    "es": "Qué es lo que empieza?",
    "en": "la película, entonces SUBJECT = THE FILM"
  },
  {
    "es": "Qué tiempo verbal utilizamos?",
    "en": "present continuous, porque lo estás buscando en este momento."
  },
  {
    "es": "Qué hora es?",
    "en": "What time is it"
  },
  {
    "es": "A qué hora sale el autobús?",
    "en": "What time does the bus leave"
  },
  {
    "es": "Cómo se llama él?",
    "en": "What’s his name"
  },
  {
    "es": "Cómo se siente tu madre?",
    "en": "How is your mum feeling"
  },
  {
    "es": "A qué hora tenemos el examen?",
    "en": "What time do we have our exam"
  },
  {
    "es": "Qué es éso?",
    "en": "What’s that"
  },
  {
    "es": "A qué hora abre el supermercado?",
    "en": "What time does the supermarket open"
  },
  {
    "es": "Cuándo iremos a la playa?",
    "en": "When are we going to the beach"
  },
  {
    "es": "En qué trabaja Juan?",
    "en": "What does Juan do"
  },
  {
    "es": "Cuántos años tiene María?",
    "en": "How old is María"
  },
  {
    "es": "Funciona ese ordenador?",
    "en": "Does that computer work"
  },
  {
    "es": "Has visto a alguien?",
    "en": "igual que la oración anterior, con la única diferencia que esta oración es INTERROGATIVA. La traducción en este caso es «alguien»."
  },
  {
    "es": "Encontraste algo ahí?",
    "en": "any + thing = en oración INTERROGATIVA."
  },
  {
    "es": "Has visto mis llaves en algún sitio?",
    "en": "have you seen my keys anywhere"
  },
  {
    "es": "Alguien dijo mi nombre?",
    "en": "Did anybody say my name"
  },
  {
    "es": "Qué quieres?",
    "en": "la respuesta es ilimitada, puede ser cualquier cosa."
  },
  {
    "es": "Tienes hijos?",
    "en": "Do you have any children"
  },
  {
    "es": "Tienes zapatos para la boda?",
    "en": "do you have any shoes for the wedding"
  },
  {
    "es": "Tienes coche?",
    "en": "do you have a car"
  },
  {
    "es": "Quieres más?",
    "en": "would you like some more"
  },
  {
    "es": "Hay guisantes en el frigo?",
    "en": "are there any peas in the fridge"
  },
  {
    "es": "Tienes hermanos?",
    "en": "do you have any brothers or sisters"
  },
  {
    "es": "Has estado alguna vez en Canadá?",
    "en": "have you ever been to Canada"
  },
  {
    "es": "Has jugado alguna vez al ajedrez?",
    "en": "have you ever played chess"
  },
  {
    "es": "Has estudiado alguna vez un idioma extranjero diferente al inglés?",
    "en": "have you ever studied a foreign laguage apart from English"
  },
  {
    "es": "Has visto alguna vez una película en versión original?",
    "en": "have you ever seen a film in original version"
  },
  {
    "es": "Has hablado alguna vez inglés por teléfono?",
    "en": "have you ever spoken English on the phone"
  },
  {
    "es": "puedo abrir la ventana, por favor?",
    "en": "en este caso estoy pidiendo permiso para hacer algo, al igual que en el ejemplo de arriba, de ‘Can I go to the toilet"
  },
  {
    "es": "Puedo abrir la ventana, por favor?",
    "en": "may I open the window, please"
  },
  {
    "es": "De quién es ese móvil?",
    "en": "Whose mobile is that"
  },
  {
    "es": "De quién son esos libros?",
    "en": "Whose books are those= or Whose are those books"
  },
  {
    "es": "De quién ese coche?",
    "en": "Whose car is that"
  },
  {
    "es": "Has terminado ya el proyecto?",
    "en": "Have you finished the project yet"
  },
  {
    "es": "Dónde te lo dijo?",
    "en": "Where did he/she tell you"
  },
  {
    "es": "Cuándo la ayudaste?",
    "en": "When did you help him/her"
  },
  {
    "es": "Está estudiando ella inglés?",
    "en": "Is she studying English"
  },
  {
    "es": "Por qué no me lo dijiste?",
    "en": "Why didn’t you tell me"
  },
  {
    "es": "Estabas tomándote una cerveza cuando viste a Pedro?",
    "en": "Were you having a beer when you saw Peter"
  },
  {
    "es": "A qué hora sale el tren?",
    "en": "What time does the train leave"
  },
  {
    "es": "Alguna vez has probado la comida tailandesa?",
    "en": "Have you ever tried Thai food"
  },
  {
    "es": "Crees que bajará el paro este año?",
    "en": "Do you think that unemployment will go down this year"
  },
  {
    "es": "2. Siempre van antes del sustantivo, la regla es",
    "en": "ADJECTIVE + NOUN"
  },
  {
    "es": "Por tanto, podemos afirmar que -ed para personas y -ing para cosas o situaciones. Es cierto que a veces también utilizamos -ing para personas, y ¿cuándo? Debes tener en cuenta que la terminación -ing indica una cualidad permanente, mientras que -ed es temporal. Si yo digo",
    "en": "I’m a boring person = soy una persona aburrida, lo soy siempre, es permanente, por eso, ing. Pero si digo I’m bored = estoy aburrido, es temporal, es sólo ahora."
  },
  {
    "es": "El adjetivo dice una cualidad de algo, por ejemplo",
    "en": "grande, pequeño, bonito, feo, alargado, estrecho, etc."
  },
  {
    "es": "Por ejemplo",
    "en": "Él es guapo. ¿»Guapo» es adjetivo o adverbio? ¿A quién se refiere? A él, por tanto, ADJETIVO."
  },
  {
    "es": "often, usually y sometimes también se pueden escribir al principio de oración",
    "en": "Sometimes I have lunch in a restaurant."
  },
  {
    "es": "Normalmente se pregunta «How often» y se contesta con uno de estos adverbios, por ejemplo",
    "en": "how often do you have Italian classes? = I have every Tuesday."
  },
  {
    "es": "Cabe destacar que la palabra every es singular en inglés, por tanto, tanto «day» como cualquiera de los días que pongamos, deben ir en singular. Es incorrecto decir",
    "en": "every days o every Tuesdays."
  },
  {
    "es": "2. Los días de la semana se pueden utilizar tanto en singular como en plural, es decir, si yo digo",
    "en": "I have my English classes on Tuesdays and Thursdays puedo poner los días en plural, ya que es todos los martes y todos los jueves, no sólo uno."
  },
  {
    "es": "3. Hardly ever es otro adverbio de frecuencia que se pone entre el sujeto y el verbo y signifca apenas, casi nunca",
    "en": "I hardly ever go to the cinema = casi nunca voy al cine."
  },
  {
    "es": "1. Often / she / write to me/ doesn’t",
    "en": "she doesn’t often write to me"
  },
  {
    "es": "2. Play football on Saturday afternoons / the boys / always",
    "en": "the boys always play football on Saturday afternoons"
  },
  {
    "es": "3. usually/ arrives late / the bus",
    "en": "the bus usually arrives late"
  },
  {
    "es": "4. go to bed before 11 / often / I",
    "en": "I often go to bed before 11"
  },
  {
    "es": "5. never / drinks coffee in the evening / she",
    "en": "she never drinks coffee in the evening"
  },
  {
    "es": "6. it / rain in the summer / often / doesn’t",
    "en": "it doesn’t often rain in the summer"
  },
  {
    "es": "7. read books slowly / I / always",
    "en": "I always read books slowly"
  },
  {
    "es": "8.  usually / my father / goes to work by bus",
    "en": "my father usually goes to work by bus"
  },
  {
    "es": "dictionary / often / use / The / the / students",
    "en": "the students often use the dictionary"
  },
  {
    "es": "me / Paul / helps / sometimes / my / with / homework",
    "en": "Paul sometimes helps me with my homework o sometimes Paul helps me with my homework"
  },
  {
    "es": "visits / Jonathan / usually / dentist / the",
    "en": "Jonathan usually visits the dentist"
  },
  {
    "es": "I / fish / often / hours / for / catching / anything / without",
    "en": "I often fish for hours without catching anything"
  },
  {
    "es": "try / police / keep / The / order / always / to / the",
    "en": "The police always try to keep the order"
  },
  {
    "es": "see / usually / Jennifer / out / goes / a / to / concert",
    "en": "Jennifer usually goes out to see a concert"
  },
  {
    "es": "often / money / Sally / her / borrows / friends / from",
    "en": "Sally often borrows money from her friends"
  },
  {
    "es": "my / My / spoils / neighbour / holidays / always",
    "en": "My neighbour always spoils my holidays"
  },
  {
    "es": "angry / Our / teacher / English / usually / is",
    "en": "Our English teacher is usually angry"
  },
  {
    "es": "car / I / drink / never / if / drive / I / alcohol / a",
    "en": "I never drink alcohol if I drive a car"
  },
  {
    "es": "TV / ever / hardly / I / in / watch / evenings / the",
    "en": "I hardly ever watch TV in the evenings"
  },
  {
    "es": "Example",
    "en": "My husband is going to tell his best friend the truth. On (the) one hand, I think it’s a good idea, but on the other hand, I wouldn’t do it because he’s going to hurt his feelings."
  },
  {
    "es": "Example",
    "en": "I really love the beach whereas my partner hates it = A mí me encanta la playa mientras que mi pareja la odia."
  },
  {
    "es": "Example",
    "en": "In Spain it’s really hot in the summer, while in England it isn’t so hot, sometimes it even rains."
  },
  {
    "es": "Example",
    "en": "Since you’re still working, I won’t cook dinner yet."
  },
  {
    "es": "Example",
    "en": "He didn’t study hard for his exam. As a consequence, he failed it."
  },
  {
    "es": "Example",
    "en": "My eldest brother has blond hair, in contrast with our youngest brother, who has black hair."
  },
  {
    "es": "Example",
    "en": "I studied hard for my last exam, but unfortunately, I didn’t pass."
  },
  {
    "es": "Example",
    "en": "Unfortunately, we missed the bus and arrived late."
  },
  {
    "es": "Example",
    "en": "My mother fell down, but fortunately, she didn’t hurt herself seriously."
  },
  {
    "es": "Example",
    "en": "It is raining heavily. Nonetheless, it is not cold."
  },
  {
    "es": "Example",
    "en": "The teacher bought sweets as well as cookies for all the chidren."
  },
  {
    "es": "Example",
    "en": "As well as studying English, I’m studying French."
  },
  {
    "es": "Example",
    "en": "My partner likes football. I like it as well."
  },
  {
    "es": "For example",
    "en": "She drives carefully."
  },
  {
    "es": "En español diríamos",
    "en": "Sharon es la chica más alta de su clase = mientras que en español utilizo la preposición ‘de’ con el superlativo (más alta), en inglés la preposición es ‘in’ y el superlativo (the tallest)."
  },
  {
    "es": "Otro ejemplo",
    "en": "My partner is the most beautiful woman in the world"
  },
  {
    "es": "Los adjetivos tienen tres formas",
    "en": "la forma base, la forma comparativa y la forma superlativa. En lengua lo llamamos «grados», comparativo y superlativo."
  },
  {
    "es": "Si no recuerdas los verbos irregulares, te propongo la siguiente lista para que compruebes esa tercera columna que necesitas para formar el present perfect",
    "en": "irregular verbs. Lo bueno de esta lista es que incluye la pronunciación y además perfectamente entendible para los alumnos que no conocen los símbolos fonéticos. Espero que te sea útil."
  },
  {
    "es": "EJERCICIO",
    "en": "Translate the following sentences into English."
  },
  {
    "es": "Example",
    "en": "Enough is enough! If you don’t pass all your exams, you won’t be allowed to play computer games."
  },
  {
    "es": "En un post anterior sobre verb patterns puedes revisar la diferencia entre allow y let",
    "en": "verb patters."
  },
  {
    "es": "Otro ejemplo",
    "en": "when I was at primary school, I didn’t wear uniform."
  },
  {
    "es": "The correct thing",
    "en": "My friend has a lot of money."
  },
  {
    "es": "‘Much’ se utiliza con uncountable nouns, bien, porque ‘money’ lo es, pero en oraciones negativas, por tanto",
    "en": "My friend doesn’t have much money y my friend has a lot of money. Con oraciones positivas utilizamos ‘a lot of’."
  },
  {
    "es": "The correct thing",
    "en": "I have 3 children."
  },
  {
    "es": "The correct thing",
    "en": "information, homework, work."
  },
  {
    "es": "The correct thing",
    "en": "on the Internet"
  },
  {
    "es": "The correct thing",
    "en": "I went to a state school."
  },
  {
    "es": "– For + period of time (not defined)",
    "en": "durante o desde hace"
  },
  {
    "es": "Example",
    "en": "I have lived in Seville for 4 years = Vivo en Sevilla desde hace 4 años."
  },
  {
    "es": "Example",
    "en": "I haven’t seen my best friend since September = No he visto a mi mejor amiga desde septiembre."
  },
  {
    "es": "El genitivo sajón se utiliza para expresar posesión. Por ejemplo, si quiero decir",
    "en": "el coche de Pedro es rojo, como estamos hablando de una posesión (coche de Pedro), aquí necesitamos el genitivo sajón."
  },
  {
    "es": "Por tanto",
    "en": "Peter’s car"
  },
  {
    "es": "Otro ejemplo",
    "en": "la casa de María es grande = María’s house is big."
  },
  {
    "es": "1. el primer elemento (de esos tres que decíamos antes) es una persona. Ejemplo",
    "en": "John‘s job is boring."
  },
  {
    "es": "2. el primer elemento es un animal. Ejemplo",
    "en": "the bird‘s legs = las piernas del pájaro."
  },
  {
    "es": "3. el primer elemento es un país/ciudad/pueblo… Ejemplo",
    "en": "Spain‘s monuments are very nice."
  },
  {
    "es": "Más plurales irregulares que nos podemos encontrar son",
    "en": "men, women, people, etc."
  },
  {
    "es": "Ejemplo",
    "en": "el final de la película = the end of the film = end y film no son personas, por tanto, los unimos con of."
  },
  {
    "es": "Escribir inglés correctamente",
    "en": "uso de las mayúsculas"
  },
  {
    "es": "Recuerda",
    "en": "Spanish, English, May y Tuesday."
  },
  {
    "es": "Mi cumpleaños es en febrero",
    "en": "my birthday is in February."
  },
  {
    "es": "El cumpleaños de Pablo es el 8 de mayo",
    "en": "Paul’s birthday is on 8th May"
  },
  {
    "es": "Te veo el sábado",
    "en": "I’ll see you on Saturday"
  },
  {
    "es": "¿Estás estudiando francés?",
    "en": "are you learning French?"
  },
  {
    "es": "El marido de mi prima es alemán y su madre irlandesa",
    "en": "my cousin’s husband is German and his mother Irish."
  },
  {
    "es": "La pronunciación de thirty, importantísimo porque es un típico error del alumno hispanohablante. Ir no se pronuncia como se escribe, es decir, la i no es i, es como una e con la r. Esto no sólo sucede con el número thirty, sino siempre que tenemos ir, por ejemplo",
    "en": "skirt, shirt, first, firm, etc. Os aconsejo que escuchéis el siguiente audio y practiquéis."
  },
  {
    "es": "Esto si es un precio exacto, pero ¿y si hay céntimos? Entonces diríamos",
    "en": "it’s 5 euros and 2 cents (5.2) = es importante recordar que en inglés ponemos un punto para los decimales y no una coma, pero el punto no hay que decirlo cuando expresamos un precio. También podemos omitir «cents»."
  },
  {
    "es": "Si por cierto necesitas ayuda con la formación de preguntas, aquí tienes material",
    "en": "preguntas en inglés"
  },
  {
    "es": "Cuando hablamos de hundred, thousand y million, podemos encontrarlo con y sin -s de plural. Te explico la diferencia. Si la palabra hundred, thousand y million lleva un número delante y detrás un sustantivo, entonces no ponemos la -s de plural, por ejemplo",
    "en": "3 thousand people = tres mil personas / 2 million cars / 4 hundred children."
  },
  {
    "es": "Ahora bien, si estas palabras no llevan un número delante, se les pone la -s de plural, por ejemplo",
    "en": "thousands of people = miles de personas / hundreds of teachers = cientos de profesores / millions of dollars = millones de dólares. Como ves, en todos los casos decimos la preposición of y la -s de plural."
  },
  {
    "es": "Si el número lleva un 0 por en medio, 1903, decimos",
    "en": "nineteen oh three. Ten encuenta que el número cero lo decimos aquí «oh». El número cero se puede expresar de muchas formas distintas en inglés, según de cómo se esté utilizando. Ahora después lo veremos en detalle."
  },
  {
    "es": "En matématicas, por ejemplo, con número decimales",
    "en": "nought, pero también se puede utilizar zero. Muy importante, la pronunciación de nought es /nooot/."
  },
  {
    "es": "También que llamamos infinitivo al verbo tal cual, sin conjugar",
    "en": "read, write, eat, run, sleep, etc"
  },
  {
    "es": "Ejemplo",
    "en": "Did   (Aux)    you  (Subj)     go  (Inf)      to  (C)   work (C)  yesterday (C)?"
  },
  {
    "es": "Ejemplo",
    "en": "Are you a teacher?                     TO BE + SUBJECT + COMPLEMENT?"
  },
  {
    "es": "Pillards of the Earth",
    "en": "complement"
  },
  {
    "es": "¿Cómo saber que «the film» es el sujeto? Preguntamos al verbo SIEMPRE «quién» o «qué». Hacemos la prueba",
    "en": "¿Qué es lo que empieza? = la película, entonces SUBJECT = THE FILM"
  },
  {
    "es": "Deciros que sólo hay unas cuantas QUESTION WORDS que pueden llevar auxiliar o no llevarlo. Éstas son",
    "en": "who, what, which y how many/much. Sin embargo, when, where, why y how siempre han de llevar auxiliar."
  },
  {
    "es": "Seguramente, esta pregunta la conoces ya de hace tiempo y nunca te hayas planteado por qué el from al final, quizá la aprendiste así en su día y la tienes ya tan asimilada que no te planteas por qué la preposición está al final, cuando en español, decimos la preposición de (from) al principio",
    "en": "¿De dónde eres?"
  },
  {
    "es": "Bien, debes saber que siempre que tengas una preposición en una pregunta, y esa preposición no tenga su complemento en dicha pregunta, la preposición se dice y se escribe al final, de ahí que en ‘Where are you from?’ el ‘from’ aparece al final. Si yo pregunto ‘¿de qué tienes miedo?’, que es en inglés What are you afraid of?, ¿ verdad que no estoy diciendo a qué  cosa tengo miedo? Pues a eso me refiero cuando digo que la preposición ‘of’ no tiene a su complemento en esta pregunta. Sin embargo, si digo",
    "en": "¿Tienes miedo a los perros?, en inglés ‘Are you afraid of dogs?’, la preposición ‘of’ tiene su complemento que es ‘dogs’."
  },
  {
    "es": "Si te das cuenta, el cambio que se ha producido entre la direct y la indirect question lo encontramos en el orden de los elementos. Mientras que en la direct question teníamos la inversión entre verb to be y sujeto, como hemos dicho en la regla (Question word + to be + subjet? ), en la indirect question, ya no hay inversión, sino que tenemos question word + subject + verb. Si te das cuenta, la inversión la tenemos en ‘Can you tell me…’. Como ya tenemos una inversión al comenzar la pregunta, ya no podemos hacer otra inversión. Recuerda",
    "en": "sólo una inversión por oración!"
  },
  {
    "es": "Examples",
    "en": "I go to work by car     I like travelling by train"
  },
  {
    "es": "on + train/ bus/ plane/ bike/ motorbike",
    "en": "cuando hablamos de forma más específica."
  },
  {
    "es": "Examples",
    "en": "I was on the bus when my mother phoned me    You are not allowed to eat on the train"
  },
  {
    "es": "in + car/ taxi",
    "en": "situación específica = ésta opción siempre lleva un possessive adjective (my, your, his, her, our, their) o un artículo indefinido (a)."
  },
  {
    "es": "Examples",
    "en": "a) How did you come to work?     b) I came in my car  (situación específica, concreta)"
  },
  {
    "es": "Example",
    "en": "I let my children go to school on foot."
  },
  {
    "es": "Example",
    "en": "There is a supermarket near my house."
  },
  {
    "es": "Example",
    "en": "The dining table is close to the TV."
  },
  {
    "es": "Example",
    "en": "Next to the school, there is a bus stop."
  },
  {
    "es": "Example",
    "en": "my car is parked in front of your house."
  },
  {
    "es": "Example",
    "en": "I sat opposite a beautiful woman on the train."
  },
  {
    "es": "Al lado de mi casa hay una guardería",
    "en": "Next to my house there is a nursery school."
  },
  {
    "es": "No me quiero sentar enfrente de él",
    "en": "I don’t want to sit opposite him."
  },
  {
    "es": "Hay muchos bares cerca de mi casa",
    "en": "There are a lot of bars near my house."
  },
  {
    "es": "Sigue recto y delante de la iglesia hay un supermercado",
    "en": "Go straight on and in front of the church there is a supermarket."
  },
  {
    "es": "Al lado de mi colegio no hay bloques de pisos",
    "en": "Next to my school there aren’t any apartment blocks."
  },
  {
    "es": "– Días de la semana",
    "en": "on Monday, on Wednesday, etc."
  },
  {
    "es": "– Fechas concretas",
    "en": "on 5th May, on Christmas Day, on New Year’s Eve, on St. Valentine’s Day, on my birthday = siempre que sea una fecha concreta, ese día y no otro, utilizamos la preposición on."
  },
  {
    "es": "– On + adjective + day = on a rainy day, on a sunny day. Ejemplo",
    "en": "I don’t let my children go out on a rainy day = no dejo a mis hijos salir en días lluviosos."
  },
  {
    "es": "– Meses del año",
    "en": "in May, in August, etc."
  },
  {
    "es": "– Años",
    "en": "in 1999, in 2015, etc."
  },
  {
    "es": "– Seasons (estaciones)",
    "en": "in summer, in winter."
  },
  {
    "es": "– Con partes del día",
    "en": "in the morning, in the afternoon, in the evening, pero at night (es una excepción)"
  },
  {
    "es": "– Horas",
    "en": "at 10 o’clock"
  },
  {
    "es": "Algunos ejemplos",
    "en": "at  in  on  for  to  of  without"
  },
  {
    "es": "Un ejemplo de to seguido de infinitivo es",
    "en": "I want to go to the cinema. En este caso to  no es una preposición, sino la palabra que se utiliza para unir dos verbos, want y go, ya que el verbo want siempre va seguido de to infinitive. Por tanto, cuando veas por ahí un to seguido de un -ing ya sabes que el to es preposición!"
  },
  {
    "es": "Example",
    "en": "We’re x teachers. (x significa que no escribimos nada)"
  },
  {
    "es": "EXERCISE",
    "en": "traducir español inglés"
  },
  {
    "es": "Sin embargo, si queremos expresar la familia de «cualquier» y éste aparece a principo de oración, debemos utilizar la «any», ejemplo",
    "en": "anybody can answer = cualquiera puede contestar / anything affects her = cualquier cosa le afecta."
  },
  {
    "es": "Cuando «nada», «nadie» o «ningún sitio» NO va en primera posición (no es el sujeto, sino el objeto), podemos utilizar «any» o «no», dependiendo de cómo pongamos el verbo, negado o sin negar. Si lo pongo negado, entonces utilizamos «any» y si lo pongo sin negar (es positivo), entonces utilizamos «no». Esto es así porque en inglés sólo es posible poner una palabra negativa en una oración, nunca dos, como sucede en español. Yo es español puedo decir",
    "en": "no vi nada = no es una palabra negativa, y nada, otra. Esto es imposible en inglés, o niego el verbo o niego el pronombre indefinido, pero nunca ambos."
  },
  {
    "es": "EXERCISE 1",
    "en": "complete the gaps with an object pronoun, a possessive adjective or a possessive pronoun."
  },
  {
    "es": "EXERCISE 2",
    "en": "choose the best option, a possessive adjective or a possessive pronoun."
  },
  {
    "es": "2. Let’s do the same with the first example",
    "en": "Who is celebrating dad’s birthday? = the answer is My family and I, so subject!"
  },
  {
    "es": "Countable nouns",
    "en": "se pueden contar. Es decir, la palabra mesa, yo puedo decir, una mesa, dos mesas, tres mesas, 500 mesas, etc."
  },
  {
    "es": "Uncountable nouns",
    "en": "no se pueden contar. Por ejemplo, azúcar, no puedo decir dos azúcares, 7 azúcares, simplemente, azúcar como tal, como sustancia «en grano»."
  },
  {
    "es": "Much, como se utiliza con uncountable, decimos",
    "en": "I haven’t got much money (remember, money is uncountable)."
  },
  {
    "es": "Many, para countable, decimos",
    "en": "I don’t have many friends (friends is countable)."
  },
  {
    "es": "A lot of, countable y uncountable",
    "en": "I have a lot of money and I have a lot of friends."
  },
  {
    "es": "Si te das cuenta, el ejemplo con much es negativo, porque much va con oraciones negativas. Many, por su parte, también va en oraciones negativas, como en el ejemplo de arriba (I don’t have many friends), pero también en positivas, por ejemplo",
    "en": "many people think that he behaved badly. Por otro lado, a lot of va seguido de oración positiva, ya sea con sustantivos contables o incontables."
  },
  {
    "es": "Common mistake",
    "en": "I don’t know that I will do."
  },
  {
    "es": "Si pasamos la oración a interrogativa, quedaría así",
    "en": "Do you have any friends who live near your house? = al ser interrogativa, any."
  },
  {
    "es": "Y en negativa",
    "en": "I don’t have any friends who live near my house."
  },
  {
    "es": "Y por último, deciros que hay un caso en el que some se utiliza con preguntas, en lugar de any. Cuando nos encontramos con ofrecimientos, por ejemplo",
    "en": "would you like some coke?"
  },
  {
    "es": "Otro ejemplo",
    "en": "My friend is 25 years old = who is 25 years old? = my friend, por tanto, my friend es el sujeto."
  },
  {
    "es": "Example",
    "en": "I enjoyed the party / I enjoyed the film / I enjoyed my day off."
  },
  {
    "es": "Example",
    "en": "I enjoy swimming in the pool / I enjoy watching TV / I enjoy travelling = para cosas que te gustan"
  },
  {
    "es": "Se pueden contraer = ‘ve got/ haven’t got (to be",
    "en": "‘m/ ‘s, etc)"
  },
  {
    "es": "Common mistake",
    "en": "I hadn’t got a mobile."
  },
  {
    "es": "Common mistake",
    "en": "Had you got a motorbike…?"
  },
  {
    "es": "Otro common mistake",
    "en": "I haven’t a car."
  },
  {
    "es": "The correct thing",
    "en": "I haven’t got a car."
  },
  {
    "es": "Otro common mistake",
    "en": "Have you a car?"
  },
  {
    "es": "The correct thing",
    "en": "Have you got a car?"
  },
  {
    "es": "Verbos irregulares",
    "en": "como irregulares que son, tienen una forma distinta a la forma regular comentada en el punto 1, y se deben aprender de memoria. Te recomiendo que te hagas con una lista de verbos irregulares, que la puedes encontrar en nuestra web (lista de verbos irregulares). Verás que esta lista está dividida en tres columnas, infinitivo, past simple y past participle. Para formar el past simple de un verbo irregular tendrás que utilizar por tanto, la segunda columna."
  },
  {
    "es": "Acción en el pasado que está en progreso, ¿qué quiere decir esto? Bien, una acción en progreso quiere decir que no está acabada, pero tú te preguntarás, si es pasada, ¿cómo que no está acabada? Quiere decir que cuando tú piensas en esa acción pasada estás al recordarla como viviéndola de nuevo, y en ese sentido decimos que está en progreso. Ejemplo",
    "en": "Yesterday at 8 p.m. I was watching TV = está acción ocurrió en el pasado, pero cuando tú lo dices, es como si te trasladaras a ayer a las 8 y la vivieras de nuevo, y a eso nos referimos cuando decimos «en progreso». Como ves, se trata de una acción larga en el pasado."
  },
  {
    "es": "Dos acciones en el pasado que ocurren al mismo tiempo. Aquí podemos utilizar when y while. Ejemplo",
    "en": "I was watching TV while my husband was reading a book = los dos estamos haciendo algo, cada uno una acción, pero están ocurriendo las dos acciones al mismo tiempo."
  },
  {
    "es": "Example",
    "en": "– What do you do?  – I’m a teacher."
  },
  {
    "es": "Common mistake",
    "en": "– What do you do?  – I’m watching TV. = – ¿Cuál es tu profesión?  – Estoy viendo la tele."
  },
  {
    "es": "EJERCICIO",
    "en": "traducir español inglés"
  },
  {
    "es": "Empecemos analizando el siguiente ejemplo",
    "en": "Have you ever written a poem? Como vemos, formulamos la pregunta con HAVE + SUBJECT + EVER + WRITTEN (PAST PARTICIPLE)."
  },
  {
    "es": "Cuando queremos hacer una pregunta con el Present Perfec, necesitamos una inversión de Have, como en nuestro ejemplo",
    "en": "Have you ever written a poem? = tenemos la inversión de have, seguido del sujeto  más el participio written, que es irregular."
  },
  {
    "es": "Example",
    "en": "I can speak English"
  },
  {
    "es": "2. El infinitivo no lleva delante to. Un error típico es decir",
    "en": "I can to speak English."
  },
  {
    "es": "Example",
    "en": "I can’t go to work because I’m sick today."
  },
  {
    "es": "Example",
    "en": "Can I go to the toilet, teacher?"
  },
  {
    "es": "Example",
    "en": "I can swim = sé nadar. El caso de la ability no lo traducimos por poder, no diría «puedo nadar», sino por saber."
  },
  {
    "es": "Example",
    "en": "can I open the window, please? It’s too hot in here = ¿puedo abrir la ventana, por favor? = en este caso estoy pidiendo permiso para hacer algo, al igual que en el ejemplo de arriba, de ‘Can I go to the toilet?’, imaginemos que lo pregunto un alumno a su profesor en el transcurro de una clase."
  },
  {
    "es": "También utilizamos en Can I have…? para pedirle a alguien que nos dé algo, que nos deje ver algo, que nos enseñe algo, por ejemplo, en la recepción de un hotel, el recepcionista, cuando nos pida el DNI, o el pasaporte, o la tarjeta de crédito nos dirá",
    "en": "Can I have your ID/ passport/ credit card?."
  },
  {
    "es": "As any modal verb, they are followed by an infinitive without ‘to’, for example",
    "en": "may come, might go."
  },
  {
    "es": "Example",
    "en": "I may go to the beach on Sunday. Let’s see if I have free time at last!  = Puede que vaya a la playa el domingo or igual voy a playa el domingo. ¡A ver si por fin tengo tiempo!"
  },
  {
    "es": "This is another translation",
    "en": "igual hago algo… (but I’m not sure…)."
  },
  {
    "es": "Veamos una oración con futuro",
    "en": "What will the weather be like tomorrow? It’ll be sunny."
  },
  {
    "es": "La podemos contestar de la seguiente manera",
    "en": "It’s mine (es mía) o it’s his (es suya – de él)"
  },
  {
    "es": "Para responder en plural, diríamos",
    "en": "They’re mine (son míos) OR they’re his (son suyos – de él)."
  },
  {
    "es": "EXERCISE 1",
    "en": "Use the two sentences to make one sentence. Follow the example"
  },
  {
    "es": "1. La puerta de mi casa",
    "en": "the door of my house"
  },
  {
    "es": "2. La hamburguesa de Harry",
    "en": "Harry’s burger"
  },
  {
    "es": "3. Las hermanas de Pedro",
    "en": "Peter’s sisters"
  },
  {
    "es": "4. La pelota de las niñas",
    "en": "The girls’ ball"
  },
  {
    "es": "5. El zumo de tu abuela",
    "en": "Your grandmother’s juice"
  },
  {
    "es": "6. Los juguetes de mis hijos",
    "en": "My children’s toys"
  },
  {
    "es": "7. La casa de mis primos es muy grande",
    "en": "My cousins’ house is very big"
  },
  {
    "es": "Antes de poneros a hacer el ejercicio que os propongo hoy de indirect questions, os animo a que leáis la explicación y aprendáis, o repaséis, qué es y cómo se forman las indirect questions (preguntas indirectas). Aquí lo puedes revisar",
    "en": "Indirect questions en inglés."
  },
  {
    "es": "EJERCICIO",
    "en": "make questions using the present simple or past simple."
  },
  {
    "es": "Los tiempos verbales en inglés son muy importantes cuando nos disponemos a aprender inglés, es por ello que se empiezan a estudiar desde los primeros días. Digo que son importantísimos porque sin tiempos verbales no se puede hablar un inglés correcto, sino que hablaríamos como se suele decir, como los indios. Hoy os propongo un ejercicio de traducción para practicar los tiempos verbales en inglés de un nivel A2. Tendrás que saber para este ejercicio los siguientes tiempos verbales",
    "en": "present simple, past simple, present continuous, past continuous, present perfect, future. Te recuerdo que en la sección NIVEL A2 (pre-intermediate) puedes repasar dichos tiempos verbales. Vamos al ejercicio"
  },
  {
    "es": "Bookstore (Br Eng",
    "en": "bookshop) Librería"
  },
  {
    "es": "Chips (Br Eng) (Am Eng",
    "en": "biscuit) Patatas fritas"
  },
  {
    "es": "Cookie (Br Eng",
    "en": "biscuit) Galleta"
  },
  {
    "es": "(Br Eng",
    "en": "driver’s license)"
  },
  {
    "es": "Drugstore (Br Eng",
    "en": "chemist) Farmacia"
  },
  {
    "es": "Elevator (Br Eng",
    "en": "lift) Ascensor"
  },
  {
    "es": "Eraser (Br Eng",
    "en": "rubber) Goma de borrar"
  },
  {
    "es": "•in the fall (Br Eng",
    "en": "autumn) En otoño"
  },
  {
    "es": "French fries (Br Eng",
    "en": "chips) Patatas fritas"
  },
  {
    "es": "Grey (Br Eng) (Am Eng",
    "en": "gray) Gris"
  },
  {
    "es": "Litre (Br Eng) (Am Eng",
    "en": "liter) Litro"
  },
  {
    "es": "Metre (Br Eng) (Am Eng",
    "en": "meter) Metro"
  },
  {
    "es": "Movie (Br Eng",
    "en": "film) Película"
  },
  {
    "es": "Movie star (Br Eng",
    "en": "film star) Estrella de cine"
  },
  {
    "es": "Movie theater (Br Eng",
    "en": "cinema) Cine"
  },
  {
    "es": "Pack Empaquetar\f•Pack a suitcase Page Pain Paint Painter Painting Pale Pair •A pair of shoes Panda Paper Paragraph Pardon •Pardon? Parent Park Parking lot (Br Eng",
    "en": "car park) Parrot Part •The best part of the day Partner Party Pass •You pass the station on the"
  },
  {
    "es": "(Am Eng",
    "en": "bathing suit)"
  },
  {
    "es": "Tyre (Am Eng",
    "en": "tire) Neumático"
  }
]