{
  "title": "Digital Investments & Wealth Management",
  "sections": [
    {
      "id": "vocab",
      "title": "Investment & Asset Vocabulary",
      "content": "Modern investing is no longer just for experts. Digital platforms allow anyone to build a diverse portfolio of assets.\n\n- **Stocks / Shares**: Units of ownership in a company that can be bought or sold on a stock exchange.\n- **ETFs (Exchange-Traded Funds)**: A collection of many stocks or bonds that you can buy as a single unit to diversify your risk.\n- **Portfolio**: The complete collection of all your financial investments, such as stocks, bonds, and crypto.\n- **Robo-advisor**: A digital platform that provides automated, algorithm-driven financial planning services with little to no human supervision.\n- **Yield**: The earnings generated and realized on an investment over a particular period of time.\n- **Volatility**: A statistical measure of the dispersion of returns; high volatility means the price changes quickly and unpredictably.\n- **Diversification**: The strategy of spreading your investments across different assets to reduce overall risk."
    },
    {
      "id": "diagram",
      "title": "Portfolio Diversification Strategy",
      "content": "```mermaid\npie title Typical Digital Portfolio\n    \"ETFs (Low Risk)\" : 50\n    \"Individual Stocks\" : 30\n    \"Digital Assets/Crypto\" : 10\n    \"Cash/Savings\" : 10\n```"
    },
    {
      "id": "grammar",
      "title": "Present Perfect with 'For' and 'Since'",
      "content": "We use the **Present Perfect** with **for** and **since** to talk about actions that started in the past and continue into the present.\n\n**Since + Specific Point in Time:**\nUse **since** to mention the exact moment the action began (a year, a date, a specific event).\n- *I have invested in ETFs **since** 2018.*\n- *She has used that robo-advisor **since** she started her new job.*\n- *They have owned Apple shares **since** last Tuesday.*\n\n**For + Period of Time:**\nUse **for** to mention a duration or length of time (number of hours, days, months, years).\n- *I have had this portfolio **for** five years.*\n- *He has been a trader **for** a long time.*\n- *We have held these bonds **for** six months.*\n\n**Asking about duration:**\nUse **How long** to ask about the length of time an action has been happening.\n- *How long have you used this investment app?*"
    }
  ],
  "objectives": [
    "Identify different types of digital investment assets like ETFs",
    "Understand the importance of diversification and risk management",
    "Use 'for' and 'since' to describe how long you have held investments"
  ],
  "keyTerms": [
    { "term": "Volatility", "definition": "How much the price of an asset fluctuates over time." },
    { "term": "Robo-advisor", "definition": "An automated investment service that uses algorithms to manage your money." }
  ]
}
