{
  "title": "Week 1: Foundations of Financial Modeling",
  "content": "# Introduction to Financial Modeling\n\nAt the C1 level, financial modeling is not just about Excel; it's about translating business strategy into a quantitative framework. This week explores the principles of building robust, flexible, and accurate financial models.\n\n## Core Principles of Modeling\n1. **Integrity**: The model must be logically sound and free of circular references (unless intentional and managed).\n2. **Flexibility**: The model should allow users to change assumptions and see results instantly (Sensitivity Analysis).\n3. **Transparency**: Formulas should be easy to follow, and hard-coding should be avoided (use separate input cells).\n\n## The Three-Statement Model\nThe foundation of most corporate models is the integration of the three core financial statements:\n- **Income Statement**: Driven by revenue and expense assumptions.\n- **Balance Sheet**: Driven by working capital, CAPEX, and financing assumptions.\n- **Cash Flow Statement**: Derived from the Income Statement and Balance Sheet.\n\n## Key Terminology\n- **CAPEX (Capital Expenditure)**: Funds used by a company to acquire, upgrade, and maintain physical assets.\n- **OPEX (Operating Expenditure)**: Ongoing costs for running a product, business, or system.\n- **Working Capital**: Current Assets - Current Liabilities; a measure of operational liquidity.\n\n## Grammar: Inversion for Emphasis\nIn executive summaries, inversion adds a formal, high-stakes tone:\n- *Never have we seen such a rapid increase in EBITDA.*\n- *Only after the audit was complete did the true valuation emerge.*",
  "objectives": [
    "Identify the fundamental principles of robust financial modeling",
    "Understand the structure of a three-statement integrated model",
    "Apply inversion for emphasis in formal financial writing"
  ],
  "keyTerms": [
    { "term": "Sensitivity Analysis", "definition": "A technique used to determine how different values of an independent variable impact a particular dependent variable under a given set of assumptions." },
    { "term": "Hard-coding", "definition": "The practice of embedding data directly into a formula instead of referencing an input cell." },
    { "term": "EBITDA", "definition": "Earnings Before Interest, Taxes, Depreciation, and Amortization." }
  ]
}
