{
  "title": "Month 2 Review and Financial Reporting",
  "sections": [
    {
      "id": "financial-reporting",
      "title": "Financial Reporting Basics",
      "content": "Financial reporting is the process of producing statements that disclose an organization's financial status to management, investors, and the government.\n\n### Key Financial Statements\n- **Balance Sheet**: A statement of the assets, liabilities, and capital of a business at a particular point in time.\n- **Income Statement**: A report that shows how much revenue a company earned over a specific period and the costs associated with earning that revenue (also known as P&L - Profit and Loss).\n- **Cash Flow Statement**: A statement that shows the flow of cash in and out of the business.\n- **Annual Report**: A comprehensive report on a company's activities throughout the preceding year."
    },
    {
      "id": "reporting-vocabulary",
      "title": "Vocabulary for Reporting",
      "content": "When discussing financial reports, we use specific terms to describe performance:\n- **Revenue**: Total income produced by a given source.\n- **Profit**: The financial gain, especially the difference between the amount earned and the amount spent.\n- **Loss**: When expenses exceed revenue.\n- **Margin**: The difference between the seller's cost for acquiring a product and the price for which it is sold.\n- **Audit**: An official inspection of an individual's or organization's accounts, typically by an independent body."
    },
    {
      "id": "grammar-review",
      "title": "Month 2 Grammar Review",
      "content": "This month we covered three key areas of grammar:\n\n1. **Future Forms (Week 5)**: \n   - *Will* for spontaneous decisions and predictions: \"The market **will** stabilize soon.\"\n   - *Going to* for plans and intentions: \"We **are going to** open a new branch next month.\"\n\n2. **Present Perfect (Week 6)**:\n   - Used for actions that happened at an unspecified time or started in the past and continue to the present: \"She **has worked** here for five years.\" \"We **have completed** the budget.\"\n\n3. **Adverbs of Manner (Week 7)**:\n   - Describing how something is done: \"He analyzed the report **carefully**.\" \"The company performed **well** last quarter.\""
    }
  ]
}